*** crates/events/src/bus.rs:147:9: replace EventBus::replay_from -> Result<Vec<BeadEvent>> with Ok(vec![])

*** mutation diff:
--- crates/events/src/bus.rs
+++ replace EventBus::replay_from -> Result<Vec<BeadEvent>> with Ok(vec![])
@@ -139,17 +139,17 @@
     /// Unsubscribe a pattern-based subscriber.
     pub async fn unsubscribe(&self, subscriber_id: &str) {
         let mut subscribers = self.subscribers.write().await;
         subscribers.remove(subscriber_id);
     }
 
     /// Replay events from a given event ID.
     pub async fn replay_from(&self, from: Option<EventId>) -> Result<Vec<BeadEvent>> {
-        self.store.read(from).await
+        Ok(vec![]) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Get the underlying event store.
     pub fn store(&self) -> &Arc<dyn EventStore> {
         &self.store
     }
 }

---- bus::tests::test_replay stdout ----

thread 'bus::tests::test_replay' (2432334) panicked at crates/events/src/bus.rs:536:9:
assertion `left == right` failed
  left: 0
 right: 2

failures:
    bus::tests::test_replay

test result: FAILED. 77 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
