*** crates/events/src/bus.rs:51:77: replace == with != in EventPattern::matches

*** mutation diff:
--- crates/events/src/bus.rs
+++ replace == with != in EventPattern::matches
@@ -43,17 +43,17 @@
 
 impl EventPattern {
     /// Check if an event matches this pattern.
     pub fn matches(&self, event: &BeadEvent) -> bool {
         match self {
             Self::All => true,
             Self::ByType(t) => event.event_type() == t,
             Self::ByBead(id) => event.bead_id() == *id,
-            Self::ByTypes(types) => types.iter().any(|t| event.event_type() == t),
+            Self::ByTypes(types) => types.iter().any(|t| event.event_type() != /* ~ changed by cargo-mutants ~ */ t),
         }
     }
 }
 
 /// Subscriber information.
 struct Subscriber {
     sender: broadcast::Sender<BeadEvent>,
     pattern: EventPattern,

---- bus::tests::should_match_event_by_multiple_types stdout ----

thread 'bus::tests::should_match_event_by_multiple_types' (2429469) panicked at crates/events/src/bus.rs:294:9:
ByTypes should not match when event type is not in list

failures:
    bus::tests::should_match_event_by_multiple_types

test result: FAILED. 77 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
