*** crates/events/src/durable_store.rs:121:9: replace DurableEventStore::get_events -> Result<Vec<BeadEvent>> with Ok(vec![])

*** mutation diff:
--- crates/events/src/durable_store.rs
+++ replace DurableEventStore::get_events -> Result<Vec<BeadEvent>> with Ok(vec![])
@@ -113,22 +113,17 @@
     pub fn append(&mut self, event: BeadEvent) -> Result<EventId> {
         let event_id = event.event_id();
         self.events.push(event);
         Ok(event_id)
     }
 
     /// Get all events for a specific stream (bead).
     pub fn get_events(&self, stream_id: BeadId) -> Result<Vec<BeadEvent>> {
-        Ok(self
-            .events
-            .iter()
-            .filter(|e| e.bead_id() == stream_id)
-            .cloned()
-            .collect())
+        Ok(vec![]) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Get events since a specific event ID (sequence number filtering).
     pub fn get_events_since(&self, since: EventId) -> Result<Vec<BeadEvent>> {
         // Find position of the since event
         let pos = self
             .events
             .iter()

---- durable_store::tests::test_get_events_for_stream stdout ----

thread 'durable_store::tests::test_get_events_for_stream' (2439961) panicked at crates/events/src/durable_store.rs:200:13:
assertion `left == right` failed
  left: 0
 right: 2

failures:
    durable_store::tests::test_get_events_for_stream

test result: FAILED. 77 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
