*** crates/events/src/durable_store.rs:32:9: replace EventQuery::with_stream_id -> Self with Default::default()

*** mutation diff:
--- crates/events/src/durable_store.rs
+++ replace EventQuery::with_stream_id -> Self with Default::default()
@@ -24,18 +24,17 @@
 impl EventQuery {
     /// Create a new query builder.
     pub fn new() -> Self {
         Self::default()
     }
 
     /// Filter by stream (bead) ID.
     pub fn with_stream_id(mut self, stream_id: BeadId) -> Self {
-        self.stream_id = Some(stream_id);
-        self
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Filter by event type.
     pub fn with_event_type(mut self, event_type: impl Into<String>) -> Self {
         self.event_type = Some(event_type.into());
         self
     }

---- durable_store::tests::test_query_combined_filters stdout ----

thread 'durable_store::tests::test_query_combined_filters' (2434430) panicked at crates/events/src/durable_store.rs:380:13:
assertion `left == right` failed
  left: 2
 right: 1

failures:
    durable_store::tests::test_query_combined_filters

test result: FAILED. 77 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
