*** crates/events/src/durable_store.rs:44:9: replace EventQuery::after -> Self with Default::default()

*** mutation diff:
--- crates/events/src/durable_store.rs
+++ replace EventQuery::after -> Self with Default::default()
@@ -36,18 +36,17 @@
     /// Filter by event type.
     pub fn with_event_type(mut self, event_type: impl Into<String>) -> Self {
         self.event_type = Some(event_type.into());
         self
     }
 
     /// Filter events after this timestamp.
     pub fn after(mut self, timestamp: DateTime<Utc>) -> Self {
-        self.after = Some(timestamp);
-        self
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Filter events before this timestamp.
     pub fn before(mut self, timestamp: DateTime<Utc>) -> Self {
         self.before = Some(timestamp);
         self
     }

---- durable_store::tests::should_exclude_events_at_exact_after_timestamp stdout ----

thread 'durable_store::tests::should_exclude_events_at_exact_after_timestamp' (2435362) panicked at crates/events/src/durable_store.rs:482:9:
assertion `left == right` failed: Event at exact after timestamp should be excluded
  left: 1
 right: 0

---- durable_store::tests::test_query_by_timestamp stdout ----

thread 'durable_store::tests::test_query_by_timestamp' (2435372) panicked at crates/events/src/durable_store.rs:311:13:
assertion `left == right` failed
  left: 2
 right: 1

failures:
    durable_store::tests::should_exclude_events_at_exact_after_timestamp
    durable_store::tests::test_query_by_timestamp

test result: FAILED. 76 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
