*** crates/events/src/durable_store.rs:50:9: replace EventQuery::before -> Self with Default::default()

*** mutation diff:
--- crates/events/src/durable_store.rs
+++ replace EventQuery::before -> Self with Default::default()
@@ -42,18 +42,17 @@
     /// Filter events after this timestamp.
     pub fn after(mut self, timestamp: DateTime<Utc>) -> Self {
         self.after = Some(timestamp);
         self
     }
 
     /// Filter events before this timestamp.
     pub fn before(mut self, timestamp: DateTime<Utc>) -> Self {
-        self.before = Some(timestamp);
-        self
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Limit the number of results.
     pub fn limit(mut self, limit: usize) -> Self {
         self.limit = Some(limit);
         self
     }

---- durable_store::tests::should_exclude_events_at_exact_before_timestamp stdout ----

thread 'durable_store::tests::should_exclude_events_at_exact_before_timestamp' (2435836) panicked at crates/events/src/durable_store.rs:465:9:
assertion `left == right` failed: Event at exact before timestamp should be excluded
  left: 1
 right: 0

---- durable_store::tests::should_return_builder_self_from_before stdout ----

thread 'durable_store::tests::should_return_builder_self_from_before' (2435838) panicked at crates/events/src/durable_store.rs:496:9:
assertion `left == right` failed
  left: None
 right: Some("created")

---- durable_store::tests::should_set_before_timestamp_in_builder stdout ----

thread 'durable_store::tests::should_set_before_timestamp_in_builder' (2435839) panicked at crates/events/src/durable_store.rs:420:9:
assertion `left == right` failed: before() should set the before field
  left: None
 right: Some(2026-02-02T05:58:11.603993540Z)

failures:
    durable_store::tests::should_exclude_events_at_exact_before_timestamp
    durable_store::tests::should_filter_events_before_timestamp
    durable_store::tests::should_return_builder_self_from_before
    durable_store::tests::should_set_before_timestamp_in_builder

test result: FAILED. 74 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
