*** crates/events/src/durable_store.rs:56:9: replace EventQuery::limit -> Self with Default::default()

*** mutation diff:
--- crates/events/src/durable_store.rs
+++ replace EventQuery::limit -> Self with Default::default()
@@ -48,18 +48,17 @@
     /// Filter events before this timestamp.
     pub fn before(mut self, timestamp: DateTime<Utc>) -> Self {
         self.before = Some(timestamp);
         self
     }
 
     /// Limit the number of results.
     pub fn limit(mut self, limit: usize) -> Self {
-        self.limit = Some(limit);
-        self
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Apply filters to events using iterator combinators.
     pub fn filter_events<'a>(
         &'a self,
         events: impl Iterator<Item = &'a BeadEvent> + 'a,
     ) -> impl Iterator<Item = &'a BeadEvent> + 'a {
         events

---- durable_store::tests::should_return_builder_self_from_before stdout ----

thread 'durable_store::tests::should_return_builder_self_from_before' (2436310) panicked at crates/events/src/durable_store.rs:496:9:
assertion `left == right` failed
  left: None
 right: Some("created")

---- durable_store::tests::test_event_query_filter_events stdout ----

thread 'durable_store::tests::test_event_query_filter_events' (2436313) panicked at crates/events/src/durable_store.rs:406:9:
assertion `left == right` failed
  left: 3
 right: 2

---- durable_store::tests::test_query_with_limit stdout ----

thread 'durable_store::tests::test_query_with_limit' (2436319) panicked at crates/events/src/durable_store.rs:341:13:
assertion `left == right` failed
  left: 3
 right: 2

failures:
    durable_store::tests::should_return_builder_self_from_before
    durable_store::tests::test_event_query_filter_events
    durable_store::tests::test_query_with_limit

test result: FAILED. 75 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
