*** crates/events/src/durable_store.rs:83:42: replace <= with > in EventQuery::filter_events

*** mutation diff:
--- crates/events/src/durable_store.rs
+++ replace <= with > in EventQuery::filter_events
@@ -75,17 +75,17 @@
                 if let Some(ref etype) = self.event_type {
                     if event.event_type() != etype.as_str() {
                         return false;
                     }
                 }
 
                 // Filter by after timestamp
                 if let Some(ref after) = self.after {
-                    if event.timestamp() <= *after {
+                    if event.timestamp() > /* ~ changed by cargo-mutants ~ */ *after {
                         return false;
                     }
                 }
 
                 // Filter by before timestamp
                 if let Some(ref before) = self.before {
                     if event.timestamp() >= *before {
                         return false;

---- durable_store::tests::should_exclude_events_at_exact_after_timestamp stdout ----

thread 'durable_store::tests::should_exclude_events_at_exact_after_timestamp' (2438352) panicked at crates/events/src/durable_store.rs:483:9:
assertion `left == right` failed: Event at exact after timestamp should be excluded
  left: 1
 right: 0

---- durable_store::tests::test_query_by_timestamp stdout ----

thread 'durable_store::tests::test_query_by_timestamp' (2438362) panicked at crates/events/src/durable_store.rs:313:13:
assertion `left == right` failed
  left: "created"
 right: "state_changed"

failures:
    durable_store::tests::should_exclude_events_at_exact_after_timestamp
    durable_store::tests::test_query_by_timestamp

test result: FAILED. 76 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
