*** crates/events/src/error.rs:35:9: replace <impl fmt::Display for Error>::fmt -> fmt::Result with Ok(Default::default())

*** mutation diff:
--- crates/events/src/error.rs
+++ replace <impl fmt::Display for Error>::fmt -> fmt::Result with Ok(Default::default())
@@ -27,48 +27,17 @@
     /// Invalid state transition.
     InvalidTransition { from: String, to: String },
     /// Internal error.
     Internal(String),
 }
 
 impl fmt::Display for Error {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
-        match self {
-            Self::StoreFailed { operation, reason } => {
-                write!(f, "event store operation '{operation}' failed: {reason}")
-            }
-            Self::EventNotFound { event_id } => {
-                write!(f, "event '{event_id}' not found")
-            }
-            Self::InvalidEvent { reason } => {
-                write!(f, "invalid event: {reason}")
-            }
-            Self::SubscriptionFailed { reason } => {
-                write!(f, "subscription failed: {reason}")
-            }
-            Self::ChannelClosed => {
-                write!(f, "event channel closed")
-            }
-            Self::Serialization { reason } => {
-                write!(f, "serialization error: {reason}")
-            }
-            Self::ProjectionFailed { projection, reason } => {
-                write!(f, "projection '{projection}' failed: {reason}")
-            }
-            Self::BeadNotFound { bead_id } => {
-                write!(f, "bead '{bead_id}' not found")
-            }
-            Self::InvalidTransition { from, to } => {
-                write!(f, "invalid state transition from '{from}' to '{to}'")
-            }
-            Self::Internal(msg) => {
-                write!(f, "internal error: {msg}")
-            }
-        }
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl std::error::Error for Error {}
 
 impl Error {
     /// Create a store failed error.
     pub fn store_failed(operation: impl Into<String>, reason: impl Into<String>) -> Self {

---- error::tests::test_error_display stdout ----

thread 'error::tests::test_error_display' (2444899) panicked at crates/events/src/error.rs:109:9:
assertion failed: err.to_string().contains("append")

failures:
    error::tests::test_error_display

test result: FAILED. 77 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
