*** crates/events/src/projection.rs:118:9: replace AllBeadsState::in_state -> Vec<&BeadProjection> with vec![]

*** mutation diff:
--- crates/events/src/projection.rs
+++ replace AllBeadsState::in_state -> Vec<&BeadProjection> with vec![]
@@ -110,20 +110,17 @@
 
     /// Get a bead projection.
     pub fn get(&self, bead_id: &BeadId) -> Option<&BeadProjection> {
         self.beads.get(bead_id)
     }
 
     /// Get beads in a given state.
     pub fn in_state(&self, state: BeadState) -> Vec<&BeadProjection> {
-        self.beads
-            .values()
-            .filter(|b| b.current_state == state)
-            .collect()
+        vec![] /* ~ changed by cargo-mutants ~ */
     }
 
     /// Get ready beads (not blocked).
     pub fn ready(&self) -> Vec<&BeadProjection> {
         self.beads.values().filter(|b| b.is_ready()).collect()
     }
 
     /// Get blocked beads.

---- projection::tests::should_filter_beads_by_state_correctly stdout ----

thread 'projection::tests::should_filter_beads_by_state_correctly' (2454436) panicked at crates/events/src/projection.rs:392:9:
assertion `left == right` failed: Should return exactly one Ready bead
  left: 0
 right: 1

failures:
    projection::tests::should_filter_beads_by_state_correctly

test result: FAILED. 77 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
