*** crates/events/src/projection.rs:152:13: delete match arm BeadEvent::Created{bead_id, spec, ..} in <impl Projection for AllBeadsProjection>::apply

*** mutation diff:
--- crates/events/src/projection.rs
+++ delete match arm BeadEvent::Created{bead_id, spec, ..} in <impl Projection for AllBeadsProjection>::apply
@@ -144,26 +144,17 @@
 }
 
 #[async_trait]
 impl Projection for AllBeadsProjection {
     type State = AllBeadsState;
 
     fn apply(&self, state: &mut Self::State, event: &BeadEvent) {
         match event {
-            BeadEvent::Created { bead_id, spec, .. } => {
-                let mut projection = BeadProjection::new(*bead_id);
-                projection.spec = Some(spec.clone());
-                projection.dependencies = spec.dependencies.clone();
-
-                // Update state counts
-                *state.state_counts.entry(BeadState::Pending).or_insert(0) += 1;
-
-                state.beads.insert(*bead_id, projection);
-            }
+             /* ~ changed by cargo-mutants ~ */
             BeadEvent::StateChanged {
                 bead_id, from, to, ..
             } => {
                 if let Some(bead) = state.beads.get_mut(bead_id) {
                     bead.current_state = *to;
                     bead.history.push(StateTransition::new(*from, *to));
 
                     // Update state counts

---- projection::tests::should_resolve_dependencies stdout ----

thread 'projection::tests::should_resolve_dependencies' (2457194) panicked at crates/events/src/projection.rs:520:9:
assertion failed: state.beads.get(&bead_id).map(|b| b.is_blocked()).unwrap_or(false)

---- projection::tests::test_all_beads_projection_created stdout ----

thread 'projection::tests::test_all_beads_projection_created' (2457203) panicked at crates/events/src/projection.rs:598:9:
assertion failed: state.beads.contains_key(&bead_id)

---- projection::tests::test_all_beads_projection_state_changed stdout ----

thread 'projection::tests::test_all_beads_projection_state_changed' (2457204) panicked at crates/events/src/projection.rs:619:9:
assertion `left == right` failed
  left: None
 right: Some(Scheduled)

failures:
    projection::tests::should_resolve_dependencies
    projection::tests::should_track_claimed_agent
    projection::tests::should_track_phase_completion
    projection::tests::should_update_state_counts_on_bead_creation
    projection::tests::test_all_beads_projection_created
    projection::tests::test_all_beads_projection_state_changed
    projection::tests::test_managed_projection
    projection::tests::test_projection_rebuild

test result: FAILED. 70 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
