*** crates/events/src/projection.rs:259:9: replace ManagedProjection<P>::rebuild_with_progress -> Result<()> with Ok(())

*** mutation diff:
--- crates/events/src/projection.rs
+++ replace ManagedProjection<P>::rebuild_with_progress -> Result<()> with Ok(())
@@ -251,23 +251,17 @@
     }
 
     /// Rebuild from a store with optional progress tracking.
     pub async fn rebuild_with_progress(
         &self,
         store: &dyn EventStore,
         tracker: Option<&ReplayTracker>,
     ) -> Result<()> {
-        let new_state = self
-            .projection
-            .rebuild_with_progress(store, tracker)
-            .await?;
-        let mut state = self.state.write().await;
-        *state = new_state;
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use crate::store::InMemoryEventStore;
     use crate::types::Complexity;

*** result: Timeout
