*** crates/events/src/bus.rs:47:9: replace EventPattern::matches -> bool with true

*** mutation diff:
--- crates/events/src/bus.rs
+++ replace EventPattern::matches -> bool with true
@@ -39,22 +39,17 @@
     ByBead(crate::types::BeadId),
     /// Match events by multiple types.
     ByTypes(Vec<String>),
 }
 
 impl EventPattern {
     /// Check if an event matches this pattern.
     pub fn matches(&self, event: &BeadEvent) -> bool {
-        match self {
-            Self::All => true,
-            Self::ByType(t) => event.event_type() == t,
-            Self::ByBead(id) => event.bead_id() == *id,
-            Self::ByTypes(types) => types.iter().any(|t| event.event_type() == t),
-        }
+        true /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Subscriber information.
 struct Subscriber {
     sender: broadcast::Sender<BeadEvent>,
     pattern: EventPattern,
 }

---- bus::tests::should_match_event_by_exact_bead_id stdout ----

thread 'bus::tests::should_match_event_by_exact_bead_id' (2427579) panicked at crates/events/src/bus.rs:261:9:
ByBead should not match different bead ID

---- bus::tests::should_match_event_by_multiple_types stdout ----

thread 'bus::tests::should_match_event_by_multiple_types' (2427581) panicked at crates/events/src/bus.rs:289:9:
ByTypes should not match when event type is not in list

---- bus::tests::should_match_event_by_exact_type stdout ----

thread 'bus::tests::should_match_event_by_exact_type' (2427580) panicked at crates/events/src/bus.rs:238:9:
ByType should not match wrong event type

failures:
    bus::tests::should_deliver_events_only_to_matching_pattern_subscribers
    bus::tests::should_match_event_by_exact_bead_id
    bus::tests::should_match_event_by_exact_type
    bus::tests::should_match_event_by_multiple_types
    bus::tests::test_event_pattern_matching
    bus::tests::test_pattern_subscription

test result: FAILED. 72 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
