*** crates/events/src/event.rs:218:9: replace BeadEvent::event_id -> EventId with Default::default()

*** mutation diff:
--- crates/events/src/event.rs
+++ replace BeadEvent::event_id -> EventId with Default::default()
@@ -210,28 +210,17 @@
             bead_id,
             metadata,
             timestamp: Utc::now(),
         }
     }
 
     /// Get the event ID.
     pub fn event_id(&self) -> EventId {
-        match self {
-            Self::Created { event_id, .. }
-            | Self::StateChanged { event_id, .. }
-            | Self::PhaseCompleted { event_id, .. }
-            | Self::DependencyResolved { event_id, .. }
-            | Self::Failed { event_id, .. }
-            | Self::Completed { event_id, .. }
-            | Self::Claimed { event_id, .. }
-            | Self::Unclaimed { event_id, .. }
-            | Self::PriorityChanged { event_id, .. }
-            | Self::MetadataUpdated { event_id, .. } => *event_id,
-        }
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Get the bead ID.
     pub fn bead_id(&self) -> BeadId {
         match self {
             Self::Created { bead_id, .. }
             | Self::StateChanged { bead_id, .. }
             | Self::PhaseCompleted { bead_id, .. }

---- durable_store::tests::test_get_events_since stdout ----

thread 'durable_store::tests::test_get_events_since' (2447149) panicked at crates/events/src/durable_store.rs:249:13:
assertion `left == right` failed
  left: 3
 right: 2

---- bus::tests::test_replay stdout ----

thread 'bus::tests::test_replay' (2447140) panicked at crates/events/src/bus.rs:536:9:
assertion `left == right` failed
  left: 3
 right: 2

---- store::tests::test_read_from_event stdout ----

thread 'store::tests::test_read_from_event' (2447199) panicked at crates/events/src/store.rs:247:9:
assertion `left == right` failed
  left: 3
 right: 2

failures:
    bus::tests::test_replay
    durable_store::tests::test_get_events_since
    store::tests::test_read_from_event

test result: FAILED. 75 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
