*** crates/events/src/projection.rs:126:9: replace AllBeadsState::ready -> Vec<&BeadProjection> with vec![]

*** mutation diff:
--- crates/events/src/projection.rs
+++ replace AllBeadsState::ready -> Vec<&BeadProjection> with vec![]
@@ -118,17 +118,17 @@
         self.beads
             .values()
             .filter(|b| b.current_state == state)
             .collect()
     }
 
     /// Get ready beads (not blocked).
     pub fn ready(&self) -> Vec<&BeadProjection> {
-        self.beads.values().filter(|b| b.is_ready()).collect()
+        vec![] /* ~ changed by cargo-mutants ~ */
     }
 
     /// Get blocked beads.
     pub fn blocked(&self) -> Vec<&BeadProjection> {
         self.beads.values().filter(|b| b.is_blocked()).collect()
     }
 }

---- projection::tests::should_return_only_ready_unblocked_beads stdout ----

thread 'projection::tests::should_return_only_ready_unblocked_beads' (2455570) panicked at crates/events/src/projection.rs:432:9:
assertion `left == right` failed: Should return exactly one ready bead
  left: 0
 right: 1

failures:
    projection::tests::should_return_only_ready_unblocked_beads

test result: FAILED. 77 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
