*** crates/events/src/projection.rs:158:76: replace += with -= in <impl Projection for AllBeadsProjection>::apply

*** mutation diff:
--- crates/events/src/projection.rs
+++ replace += with -= in <impl Projection for AllBeadsProjection>::apply
@@ -150,17 +150,17 @@
     fn apply(&self, state: &mut Self::State, event: &BeadEvent) {
         match event {
             BeadEvent::Created { bead_id, spec, .. } => {
                 let mut projection = BeadProjection::new(*bead_id);
                 projection.spec = Some(spec.clone());
                 projection.dependencies = spec.dependencies.clone();
 
                 // Update state counts
-                *state.state_counts.entry(BeadState::Pending).or_insert(0) += 1;
+                *state.state_counts.entry(BeadState::Pending).or_insert(0) -= /* ~ changed by cargo-mutants ~ */ 1;
 
                 state.beads.insert(*bead_id, projection);
             }
             BeadEvent::StateChanged {
                 bead_id, from, to, ..
             } => {
                 if let Some(bead) = state.beads.get_mut(bead_id) {
                     bead.current_state = *to;

---- projection::tests::should_clear_claimed_agent_on_unclaim stdout ----

thread 'projection::tests::should_clear_claimed_agent_on_unclaim' (2460152) panicked at crates/events/src/projection.rs:158:17:
attempt to subtract with overflow

---- projection::tests::should_resolve_dependencies stdout ----

thread 'projection::tests::should_resolve_dependencies' (2460158) panicked at crates/events/src/projection.rs:158:17:
attempt to subtract with overflow

---- projection::tests::should_track_claimed_agent stdout ----

thread 'projection::tests::should_track_claimed_agent' (2460164) panicked at crates/events/src/projection.rs:158:17:
attempt to subtract with overflow

failures:
    projection::tests::should_clear_claimed_agent_on_unclaim
    projection::tests::should_resolve_dependencies
    projection::tests::should_track_claimed_agent
    projection::tests::should_track_phase_completion
    projection::tests::should_update_state_counts_on_bead_creation
    projection::tests::test_all_beads_projection_created
    projection::tests::test_all_beads_projection_state_changed
    projection::tests::test_managed_projection
    projection::tests::test_managed_projection_rebuild_with_progress
    projection::tests::test_projection_rebuild
    projection::tests::test_projection_rebuild_with_progress

test result: FAILED. 67 passed; 11 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
