*** crates/events/src/projection.rs:209:9: replace <impl Projection for AllBeadsProjection>::initial_state -> Self::State with Default::default()

*** mutation diff:
--- crates/events/src/projection.rs
+++ replace <impl Projection for AllBeadsProjection>::initial_state -> Self::State with Default::default()
@@ -201,17 +201,17 @@
                     bead.claimed_by = None;
                 }
             }
             _ => {}
         }
     }
 
     fn initial_state(&self) -> Self::State {
-        AllBeadsState::new()
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// A managed projection with automatic updates.
 pub struct ManagedProjection<P: Projection> {
     projection: P,
     state: RwLock<P::State>,
 }

*** result: Success
