*** crates/events/src/projection.rs:87:9: replace BeadProjection::is_blocked -> bool with false

*** mutation diff:
--- crates/events/src/projection.rs
+++ replace BeadProjection::is_blocked -> bool with false
@@ -79,17 +79,17 @@
             blocked_by: Vec::new(),
             history: Vec::new(),
             claimed_by: None,
         }
     }
 
     /// Check if the bead is blocked.
     pub fn is_blocked(&self) -> bool {
-        !self.blocked_by.is_empty()
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     /// Check if the bead is ready to run.
     pub fn is_ready(&self) -> bool {
         self.current_state == BeadState::Ready && !self.is_blocked()
     }
 }

---- projection::tests::should_not_be_ready_when_blocked_even_if_state_is_ready stdout ----

thread 'projection::tests::should_not_be_ready_when_blocked_even_if_state_is_ready' (2450438) panicked at crates/events/src/projection.rs:337:9:
Blocked bead should not be ready even if state is Ready

---- projection::tests::should_report_blocked_when_blocked_by_is_not_empty stdout ----

thread 'projection::tests::should_report_blocked_when_blocked_by_is_not_empty' (2450440) panicked at crates/events/src/projection.rs:297:9:
Bead with blockers should report as blocked

---- projection::tests::should_resolve_dependencies stdout ----

thread 'projection::tests::should_resolve_dependencies' (2450442) panicked at crates/events/src/projection.rs:529:9:
assertion failed: state.beads.get(&bead_id).map(|b| b.is_blocked()).unwrap_or(false)

failures:
    projection::tests::should_not_be_ready_when_blocked_even_if_state_is_ready
    projection::tests::should_report_blocked_when_blocked_by_is_not_empty
    projection::tests::should_resolve_dependencies
    projection::tests::should_return_only_blocked_beads
    projection::tests::should_return_only_ready_unblocked_beads

test result: FAILED. 73 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
