*** crates/events/src/bus.rs:50:49: replace == with != in EventPattern::matches

*** mutation diff:
--- crates/events/src/bus.rs
+++ replace == with != in EventPattern::matches
@@ -42,17 +42,17 @@
 }
 
 impl EventPattern {
     /// Check if an event matches this pattern.
     pub fn matches(&self, event: &BeadEvent) -> bool {
         match self {
             Self::All => true,
             Self::ByType(t) => event.event_type() == t,
-            Self::ByBead(id) => event.bead_id() == *id,
+            Self::ByBead(id) => event.bead_id() != /* ~ changed by cargo-mutants ~ */ *id,
             Self::ByTypes(types) => types.iter().any(|t| event.event_type() == t),
         }
     }
 }
 
 /// Subscriber information.
 struct Subscriber {
     sender: broadcast::Sender<BeadEvent>,

---- bus::tests::should_match_event_by_exact_bead_id stdout ----

thread 'bus::tests::should_match_event_by_exact_bead_id' (2428994) panicked at crates/events/src/bus.rs:260:9:
ByBead should match correct bead ID

---- bus::tests::test_event_pattern_matching stdout ----

thread 'bus::tests::test_event_pattern_matching' (2429000) panicked at crates/events/src/bus.rs:547:9:
assertion failed: EventPattern::ByBead(bead_id).matches(&event)

failures:
    bus::tests::should_match_event_by_exact_bead_id
    bus::tests::test_event_pattern_matching

test result: FAILED. 76 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
