*** crates/events/src/durable_store.rs:124:37: replace == with != in DurableEventStore::get_events

*** mutation diff:
--- crates/events/src/durable_store.rs
+++ replace == with != in DurableEventStore::get_events
@@ -116,17 +116,17 @@
         Ok(event_id)
     }
 
     /// Get all events for a specific stream (bead).
     pub fn get_events(&self, stream_id: BeadId) -> Result<Vec<BeadEvent>> {
         Ok(self
             .events
             .iter()
-            .filter(|e| e.bead_id() == stream_id)
+            .filter(|e| e.bead_id() != /* ~ changed by cargo-mutants ~ */ stream_id)
             .cloned()
             .collect())
     }
 
     /// Get events since a specific event ID (sequence number filtering).
     pub fn get_events_since(&self, since: EventId) -> Result<Vec<BeadEvent>> {
         // Find position of the since event
         let pos = self

---- durable_store::tests::test_get_events_for_stream stdout ----

thread 'durable_store::tests::test_get_events_for_stream' (2440597) panicked at crates/events/src/durable_store.rs:205:13:
assertion `left == right` failed
  left: 1
 right: 2

failures:
    durable_store::tests::test_get_events_for_stream

test result: FAILED. 77 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
