*** crates/events/src/projection.rs:158:76: replace += with *= in <impl Projection for AllBeadsProjection>::apply

*** mutation diff:
--- crates/events/src/projection.rs
+++ replace += with *= in <impl Projection for AllBeadsProjection>::apply
@@ -150,17 +150,17 @@
     fn apply(&self, state: &mut Self::State, event: &BeadEvent) {
         match event {
             BeadEvent::Created { bead_id, spec, .. } => {
                 let mut projection = BeadProjection::new(*bead_id);
                 projection.spec = Some(spec.clone());
                 projection.dependencies = spec.dependencies.clone();
 
                 // Update state counts
-                *state.state_counts.entry(BeadState::Pending).or_insert(0) += 1;
+                *state.state_counts.entry(BeadState::Pending).or_insert(0) *= /* ~ changed by cargo-mutants ~ */ 1;
 
                 state.beads.insert(*bead_id, projection);
             }
             BeadEvent::StateChanged {
                 bead_id, from, to, ..
             } => {
                 if let Some(bead) = state.beads.get_mut(bead_id) {
                     bead.current_state = *to;

---- projection::tests::should_update_state_counts_on_bead_creation stdout ----

thread 'projection::tests::should_update_state_counts_on_bead_creation' (2460639) panicked at crates/events/src/projection.rs:475:9:
assertion `left == right` failed: Pending count should be 1 after creation
  left: Some(0)
 right: Some(1)

failures:
    projection::tests::should_update_state_counts_on_bead_creation

test result: FAILED. 77 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
