*** crates/events/src/replay.rs:42:30: replace == with != in ReplayProgress::calculate_percent

*** mutation diff:
--- crates/events/src/replay.rs
+++ replace == with != in ReplayProgress::calculate_percent
@@ -34,17 +34,17 @@
             percent_complete,
             eta: None,
         }
     }
 
     /// Calculate percentage complete.
     #[allow(dead_code)]
     fn calculate_percent(&self) -> f64 {
-        if self.events_total == 0 {
+        if self.events_total != /* ~ changed by cargo-mutants ~ */ 0 {
             100.0
         } else {
             (self.events_processed as f64 / self.events_total as f64) * 100.0
         }
     }
 
     /// Update progress with new event count.
     #[allow(dead_code)]

---- replay::tests::test_replay_progress_calculate_percent stdout ----

thread 'replay::tests::test_replay_progress_calculate_percent' (2487551) panicked at crates/events/src/replay.rs:180:9:
assertion `left == right` failed
  left: 100.0
 right: 50.0

failures:
    replay::tests::test_replay_progress_calculate_percent

test result: FAILED. 77 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
