*** crates/events/src/bus.rs:141:9: replace EventBus::unsubscribe with ()

*** mutation diff:
--- crates/events/src/bus.rs
+++ replace EventBus::unsubscribe with ()
@@ -133,18 +133,17 @@
         let mut subscribers = self.subscribers.write().await;
         subscribers.insert(id.clone(), Subscriber { sender, pattern });
 
         (id, EventSubscription { receiver })
     }
 
     /// Unsubscribe a pattern-based subscriber.
     pub async fn unsubscribe(&self, subscriber_id: &str) {
-        let mut subscribers = self.subscribers.write().await;
-        subscribers.remove(subscriber_id);
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// Replay events from a given event ID.
     pub async fn replay_from(&self, from: Option<EventId>) -> Result<Vec<BeadEvent>> {
         self.store.read(from).await
     }
 
     /// Get the underlying event store.

---- bus::tests::should_remove_subscriber_on_unsubscribe stdout ----

thread 'bus::tests::should_remove_subscriber_on_unsubscribe' (2431839) panicked at crates/events/src/bus.rs:395:13:
Subscriber should be removed

failures:
    bus::tests::should_remove_subscriber_on_unsubscribe

test result: FAILED. 77 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
