*** crates/events/src/durable_store.rs:114:9: replace DurableEventStore::append -> Result<EventId> with Ok(Default::default())

*** mutation diff:
--- crates/events/src/durable_store.rs
+++ replace DurableEventStore::append -> Result<EventId> with Ok(Default::default())
@@ -106,19 +106,17 @@
 impl DurableEventStore {
     /// Create a new durable event store.
     pub fn new() -> Self {
         Self { events: Vec::new() }
     }
 
     /// Append an event to the store.
     pub fn append(&mut self, event: BeadEvent) -> Result<EventId> {
-        let event_id = event.event_id();
-        self.events.push(event);
-        Ok(event_id)
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Get all events for a specific stream (bead).
     pub fn get_events(&self, stream_id: BeadId) -> Result<Vec<BeadEvent>> {
         Ok(self
             .events
             .iter()
             .filter(|e| e.bead_id() == stream_id)

---- durable_store::tests::test_append_and_count stdout ----

thread 'durable_store::tests::test_append_and_count' (2439408) panicked at crates/events/src/durable_store.rs:173:9:
assertion `left == right` failed
  left: 0
 right: 1

---- durable_store::tests::test_get_events_for_stream stdout ----

thread 'durable_store::tests::test_get_events_for_stream' (2439410) panicked at crates/events/src/durable_store.rs:203:13:
assertion `left == right` failed
  left: 0
 right: 2

---- durable_store::tests::test_get_events_since stdout ----

thread 'durable_store::tests::test_get_events_since' (2439411) panicked at crates/events/src/durable_store.rs:247:13:
assertion `left == right` failed
  left: 0
 right: 2

failures:
    durable_store::tests::test_append_and_count
    durable_store::tests::test_get_events_for_stream
    durable_store::tests::test_get_events_since
    durable_store::tests::test_query_by_event_type
    durable_store::tests::test_query_by_timestamp
    durable_store::tests::test_query_combined_filters
    durable_store::tests::test_query_with_limit

test result: FAILED. 71 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
