*** crates/events/src/event.rs:234:9: replace BeadEvent::bead_id -> BeadId with Default::default()

*** mutation diff:
--- crates/events/src/event.rs
+++ replace BeadEvent::bead_id -> BeadId with Default::default()
@@ -226,28 +226,17 @@
             | Self::Unclaimed { event_id, .. }
             | Self::PriorityChanged { event_id, .. }
             | Self::MetadataUpdated { event_id, .. } => *event_id,
         }
     }
 
     /// Get the bead ID.
     pub fn bead_id(&self) -> BeadId {
-        match self {
-            Self::Created { bead_id, .. }
-            | Self::StateChanged { bead_id, .. }
-            | Self::PhaseCompleted { bead_id, .. }
-            | Self::DependencyResolved { bead_id, .. }
-            | Self::Failed { bead_id, .. }
-            | Self::Completed { bead_id, .. }
-            | Self::Claimed { bead_id, .. }
-            | Self::Unclaimed { bead_id, .. }
-            | Self::PriorityChanged { bead_id, .. }
-            | Self::MetadataUpdated { bead_id, .. } => *bead_id,
-        }
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Get the timestamp.
     pub fn timestamp(&self) -> DateTime<Utc> {
         match self {
             Self::Created { timestamp, .. }
             | Self::StateChanged { timestamp, .. }
             | Self::PhaseCompleted { timestamp, .. }

---- bus::tests::should_match_event_by_exact_bead_id stdout ----

thread 'bus::tests::should_match_event_by_exact_bead_id' (2447603) panicked at crates/events/src/bus.rs:260:9:
ByBead should match correct bead ID

---- bus::tests::test_event_pattern_matching stdout ----

thread 'bus::tests::test_event_pattern_matching' (2447609) panicked at crates/events/src/bus.rs:547:9:
assertion failed: EventPattern::ByBead(bead_id).matches(&event)

---- durable_store::tests::test_get_events_for_stream stdout ----

thread 'durable_store::tests::test_get_events_for_stream' (2447620) panicked at crates/events/src/durable_store.rs:205:13:
assertion `left == right` failed
  left: 0
 right: 2

failures:
    bus::tests::should_match_event_by_exact_bead_id
    bus::tests::test_event_pattern_matching
    durable_store::tests::test_get_events_for_stream
    durable_store::tests::test_query_combined_filters
    event::tests::test_completed_event
    event::tests::test_created_event
    event::tests::test_state_changed_event
    store::tests::test_read_for_bead

test result: FAILED. 70 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
