*** crates/events/src/projection.rs:120:41: replace == with != in AllBeadsState::in_state

*** mutation diff:
--- crates/events/src/projection.rs
+++ replace == with != in AllBeadsState::in_state
@@ -112,17 +112,17 @@
     pub fn get(&self, bead_id: &BeadId) -> Option<&BeadProjection> {
         self.beads.get(bead_id)
     }
 
     /// Get beads in a given state.
     pub fn in_state(&self, state: BeadState) -> Vec<&BeadProjection> {
         self.beads
             .values()
-            .filter(|b| b.current_state == state)
+            .filter(|b| b.current_state != /* ~ changed by cargo-mutants ~ */ state)
             .collect()
     }
 
     /// Get ready beads (not blocked).
     pub fn ready(&self) -> Vec<&BeadProjection> {
         self.beads.values().filter(|b| b.is_ready()).collect()
     }

---- projection::tests::should_filter_beads_by_state_correctly stdout ----

thread 'projection::tests::should_filter_beads_by_state_correctly' (2454986) panicked at crates/events/src/projection.rs:395:9:
assertion `left == right` failed: Should return exactly one Ready bead
  left: 2
 right: 1

failures:
    projection::tests::should_filter_beads_by_state_correctly

test result: FAILED. 77 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
