*** crates/events/src/projection.rs:189:52: replace != with == in <impl Projection for AllBeadsProjection>::apply

*** mutation diff:
--- crates/events/src/projection.rs
+++ replace != with == in <impl Projection for AllBeadsProjection>::apply
@@ -181,17 +181,17 @@
                 }
             }
             BeadEvent::DependencyResolved {
                 bead_id,
                 dependency_id,
                 ..
             } => {
                 if let Some(bead) = state.beads.get_mut(bead_id) {
-                    bead.blocked_by.retain(|id| id != dependency_id);
+                    bead.blocked_by.retain(|id| id == /* ~ changed by cargo-mutants ~ */ dependency_id);
                 }
             }
             BeadEvent::Claimed {
                 bead_id, agent_id, ..
             } => {
                 if let Some(bead) = state.beads.get_mut(bead_id) {
                     bead.claimed_by = Some(agent_id.clone());
                 }

---- projection::tests::should_resolve_dependencies stdout ----

thread 'projection::tests::should_resolve_dependencies' (2462047) panicked at crates/events/src/projection.rs:535:9:
Bead should not be blocked after dependency resolved

failures:
    projection::tests::should_resolve_dependencies

test result: FAILED. 77 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
