*** crates/events/src/projection.rs:87:9: replace BeadProjection::is_blocked -> bool with true

*** mutation diff:
--- crates/events/src/projection.rs
+++ replace BeadProjection::is_blocked -> bool with true
@@ -79,17 +79,17 @@
             blocked_by: Vec::new(),
             history: Vec::new(),
             claimed_by: None,
         }
     }
 
     /// Check if the bead is blocked.
     pub fn is_blocked(&self) -> bool {
-        !self.blocked_by.is_empty()
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     /// Check if the bead is ready to run.
     pub fn is_ready(&self) -> bool {
         self.current_state == BeadState::Ready && !self.is_blocked()
     }
 }

---- projection::tests::should_be_ready_only_when_state_is_ready_and_not_blocked stdout ----

thread 'projection::tests::should_be_ready_only_when_state_is_ready_and_not_blocked' (2449920) panicked at crates/events/src/projection.rs:316:9:
Ready bead with no blockers should be ready

---- projection::tests::should_report_not_blocked_when_blocked_by_is_empty stdout ----

thread 'projection::tests::should_report_not_blocked_when_blocked_by_is_empty' (2449926) panicked at crates/events/src/projection.rs:306:9:
Bead without blockers should not be blocked

---- projection::tests::should_resolve_dependencies stdout ----

thread 'projection::tests::should_resolve_dependencies' (2449927) panicked at crates/events/src/projection.rs:535:9:
Bead should not be blocked after dependency resolved

failures:
    projection::tests::should_be_ready_only_when_state_is_ready_and_not_blocked
    projection::tests::should_report_not_blocked_when_blocked_by_is_empty
    projection::tests::should_resolve_dependencies
    projection::tests::should_return_only_blocked_beads
    projection::tests::should_return_only_ready_unblocked_beads
    projection::tests::test_bead_projection_new

test result: FAILED. 72 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
