*** crates/events/src/bus.rs:131:18: replace += with -= in EventBus::subscribe_with_pattern

*** mutation diff:
--- crates/events/src/bus.rs
+++ replace += with -= in EventBus::subscribe_with_pattern
@@ -123,17 +123,17 @@
     pub async fn subscribe_with_pattern(
         &self,
         pattern: EventPattern,
     ) -> (String, EventSubscription) {
         let (sender, receiver) = broadcast::channel(100);
 
         let mut next_id = self.next_id.write().await;
         let id = format!("sub_{}", *next_id);
-        *next_id += 1;
+        *next_id -= /* ~ changed by cargo-mutants ~ */ 1;
 
         let mut subscribers = self.subscribers.write().await;
         subscribers.insert(id.clone(), Subscriber { sender, pattern });
 
         (id, EventSubscription { receiver })
     }
 
     /// Unsubscribe a pattern-based subscriber.

---- bus::tests::should_deliver_events_only_to_matching_pattern_subscribers stdout ----

thread 'bus::tests::should_deliver_events_only_to_matching_pattern_subscribers' (2430889) panicked at crates/events/src/bus.rs:131:9:
attempt to subtract with overflow

---- bus::tests::should_remove_subscriber_on_unsubscribe stdout ----

thread 'bus::tests::should_remove_subscriber_on_unsubscribe' (2430895) panicked at crates/events/src/bus.rs:131:9:
attempt to subtract with overflow

---- bus::tests::should_assign_unique_subscriber_ids stdout ----

thread 'bus::tests::should_assign_unique_subscriber_ids' (2430887) panicked at crates/events/src/bus.rs:131:9:
attempt to subtract with overflow

failures:
    bus::tests::should_assign_unique_subscriber_ids
    bus::tests::should_deliver_events_only_to_matching_pattern_subscribers
    bus::tests::should_remove_subscriber_on_unsubscribe
    bus::tests::test_pattern_subscription

test result: FAILED. 74 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
