*** crates/events/src/replay.rs:52:9: replace ReplayProgress::update with ()

*** mutation diff:
--- crates/events/src/replay.rs
+++ replace ReplayProgress::update with ()
@@ -44,19 +44,17 @@
         } else {
             (self.events_processed as f64 / self.events_total as f64) * 100.0
         }
     }
 
     /// Update progress with new event count.
     #[allow(dead_code)]
     fn update(&mut self, events_processed: u64, eta: Option<Duration>) {
-        self.events_processed = events_processed;
-        self.percent_complete = self.calculate_percent();
-        self.eta = eta;
+        () /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Thread-safe progress tracker for event replay.
 pub struct ReplayTracker {
     events_total: u64,
     events_processed: AtomicU64,
     start_time: Instant,

---- replay::tests::test_replay_progress_calculate_percent stdout ----

thread 'replay::tests::test_replay_progress_calculate_percent' (2490034) panicked at crates/events/src/replay.rs:178:9:
assertion `left == right` failed
  left: 0.0
 right: 50.0

failures:
    replay::tests::test_replay_progress_calculate_percent

test result: FAILED. 77 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
