*** crates/core/src/result.rs:175:9: replace <impl OptionExt<T> for Option<T>>::tap_some -> Self with Default::default()

*** mutation diff:
--- crates/core/src/result.rs
+++ replace <impl OptionExt<T> for Option<T>>::tap_some -> Self with Default::default()
@@ -167,20 +167,17 @@
 }
 
 impl<T> OptionExt<T> for Option<T> {
     fn ok_or_else_lazy<E, F: FnOnce() -> E>(self, err: F) -> std::result::Result<T, E> {
         self.ok_or_else(err)
     }
 
     fn tap_some<F: FnOnce(&T)>(self, f: F) -> Self {
-        if let Some(ref v) = self {
-            f(v);
-        }
-        self
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     fn tap_none<F: FnOnce()>(self, f: F) -> Self {
         if self.is_none() {
             f();
         }
         self
     }

---- result::tests::test_tap_some stdout ----

thread 'result::tests::test_tap_some' (2050330) panicked at crates/core/src/result.rs:287:9:
assertion `left == right` failed
  left: 0
 right: 42

failures:
    result::tests::test_tap_some

test result: FAILED. 14 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
