*** crates/core/src/result.rs:182:9: replace <impl OptionExt<T> for Option<T>>::tap_none -> Self with Default::default()

*** mutation diff:
--- crates/core/src/result.rs
+++ replace <impl OptionExt<T> for Option<T>>::tap_none -> Self with Default::default()
@@ -174,20 +174,17 @@
     fn tap_some<F: FnOnce(&T)>(self, f: F) -> Self {
         if let Some(ref v) = self {
             f(v);
         }
         self
     }
 
     fn tap_none<F: FnOnce()>(self, f: F) -> Self {
-        if self.is_none() {
-            f();
-        }
-        self
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     #[test]

---- result::tests::test_tap_none stdout ----

thread 'result::tests::test_tap_none' (2050545) panicked at crates/core/src/result.rs:295:9:
assertion failed: called

failures:
    result::tests::test_tap_none

test result: FAILED. 14 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
