*** crates/core/src/result.rs:55:9: replace <impl ResultExt<T> for Result<T>>::into_option_logged -> Option<T> with None

*** mutation diff:
--- crates/core/src/result.rs
+++ replace <impl ResultExt<T> for Result<T>>::into_option_logged -> Option<T> with None
@@ -47,23 +47,17 @@
     fn or_default_logged(self, default: T) -> T;
 
     /// Inspect the error without consuming the Result.
     fn inspect_error<F: FnOnce(&Error)>(self, f: F) -> Self;
 }
 
 impl<T: std::fmt::Debug> ResultExt<T> for Result<T> {
     fn into_option_logged(self) -> Option<T> {
-        match self {
-            Ok(value) => Some(value),
-            Err(e) => {
-                tracing::error!("Operation failed: {}", e);
-                None
-            }
-        }
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     fn or_default_logged(self, default: T) -> T {
         match self {
             Ok(value) => value,
             Err(e) => {
                 tracing::error!("Operation failed, using default: {}", e);
                 default

---- result::tests::test_result_into_option_ok stdout ----

thread 'result::tests::test_result_into_option_ok' (2049338) panicked at crates/core/src/result.rs:190:9:
assertion `left == right` failed
  left: None
 right: Some(42)

failures:
    result::tests::test_result_into_option_ok

test result: FAILED. 14 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
