*** crates/events/src/bus.rs:131:18: replace += with *= in EventBus::subscribe_with_pattern

*** mutation diff:
--- crates/events/src/bus.rs
+++ replace += with *= in EventBus::subscribe_with_pattern
@@ -123,17 +123,17 @@
     pub async fn subscribe_with_pattern(
         &self,
         pattern: EventPattern,
     ) -> (String, EventSubscription) {
         let (sender, receiver) = broadcast::channel(100);
 
         let mut next_id = self.next_id.write().await;
         let id = format!("sub_{}", *next_id);
-        *next_id += 1;
+        *next_id *= /* ~ changed by cargo-mutants ~ */ 1;
 
         let mut subscribers = self.subscribers.write().await;
         subscribers.insert(id.clone(), Subscriber { sender, pattern });
 
         (id, EventSubscription { receiver })
     }
 
     /// Unsubscribe a pattern-based subscriber.

---- bus::tests::should_assign_unique_subscriber_ids stdout ----

thread 'bus::tests::should_assign_unique_subscriber_ids' (2431360) panicked at crates/events/src/bus.rs:372:9:
assertion `left != right` failed: Subscriber IDs should be unique
  left: "sub_0"
 right: "sub_0"

failures:
    bus::tests::should_assign_unique_subscriber_ids

test result: FAILED. 77 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
