*** crates/events/src/bus.rs:173:9: replace EventBusBuilder::with_store -> Self with Default::default()

*** mutation diff:
--- crates/events/src/bus.rs
+++ replace EventBusBuilder::with_store -> Self with Default::default()
@@ -165,18 +165,17 @@
         Self {
             store: None,
             channel_capacity: 1000,
         }
     }
 
     /// Set the event store.
     pub fn with_store(mut self, store: Arc<dyn EventStore>) -> Self {
-        self.store = Some(store);
-        self
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Set the broadcast channel capacity.
     pub fn with_channel_capacity(mut self, capacity: usize) -> Self {
         self.channel_capacity = capacity;
         self
     }

---- bus::tests::should_build_with_store stdout ----

thread 'bus::tests::should_build_with_store' (2433155) panicked at crates/events/src/bus.rs:315:9:
Building with store should succeed

---- bus::tests::should_use_configured_store stdout ----

thread 'bus::tests::should_use_configured_store' (2433164) panicked at crates/events/src/bus.rs:324:14:
Should build: InvalidEvent { reason: "No event store configured" }

---- bus::tests::should_use_configured_channel_capacity stdout ----

thread 'bus::tests::should_use_configured_channel_capacity' (2433163) panicked at crates/events/src/bus.rs:342:14:
Should build: InvalidEvent { reason: "No event store configured" }

failures:
    bus::tests::should_build_with_store
    bus::tests::should_use_configured_channel_capacity
    bus::tests::should_use_configured_store

test result: FAILED. 75 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
