*** crates/events/src/bus.rs:47:9: replace EventPattern::matches -> bool with false

*** mutation diff:
--- crates/events/src/bus.rs
+++ replace EventPattern::matches -> bool with false
@@ -39,22 +39,17 @@
     ByBead(crate::types::BeadId),
     /// Match events by multiple types.
     ByTypes(Vec<String>),
 }
 
 impl EventPattern {
     /// Check if an event matches this pattern.
     pub fn matches(&self, event: &BeadEvent) -> bool {
-        match self {
-            Self::All => true,
-            Self::ByType(t) => event.event_type() == t,
-            Self::ByBead(id) => event.bead_id() == *id,
-            Self::ByTypes(types) => types.iter().any(|t| event.event_type() == t),
-        }
+        false /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Subscriber information.
 struct Subscriber {
     sender: broadcast::Sender<BeadEvent>,
     pattern: EventPattern,
 }

---- bus::tests::should_match_event_by_exact_type stdout ----

thread 'bus::tests::should_match_event_by_exact_type' (2428053) panicked at crates/events/src/bus.rs:232:9:
ByType should match correct event type

---- bus::tests::should_match_all_events_with_all_pattern stdout ----

thread 'bus::tests::should_match_all_events_with_all_pattern' (2428051) panicked at crates/events/src/bus.rs:223:9:
All pattern should match any event

---- bus::tests::should_match_event_by_multiple_types stdout ----

thread 'bus::tests::should_match_event_by_multiple_types' (2428054) panicked at crates/events/src/bus.rs:278:9:
ByTypes should match when event type is in list

failures:
    bus::tests::should_deliver_events_only_to_matching_pattern_subscribers
    bus::tests::should_match_all_events_with_all_pattern
    bus::tests::should_match_event_by_exact_bead_id
    bus::tests::should_match_event_by_exact_type
    bus::tests::should_match_event_by_multiple_types
    bus::tests::test_event_pattern_matching
    bus::tests::test_pattern_subscription

test result: FAILED. 71 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
