*** crates/events/src/bus.rs:49:51: replace == with != in EventPattern::matches

*** mutation diff:
--- crates/events/src/bus.rs
+++ replace == with != in EventPattern::matches
@@ -41,17 +41,17 @@
     ByTypes(Vec<String>),
 }
 
 impl EventPattern {
     /// Check if an event matches this pattern.
     pub fn matches(&self, event: &BeadEvent) -> bool {
         match self {
             Self::All => true,
-            Self::ByType(t) => event.event_type() == t,
+            Self::ByType(t) => event.event_type() != /* ~ changed by cargo-mutants ~ */ t,
             Self::ByBead(id) => event.bead_id() == *id,
             Self::ByTypes(types) => types.iter().any(|t| event.event_type() == t),
         }
     }
 }
 
 /// Subscriber information.
 struct Subscriber {

---- bus::tests::should_match_event_by_exact_type stdout ----

thread 'bus::tests::should_match_event_by_exact_type' (2428525) panicked at crates/events/src/bus.rs:237:9:
ByType should match correct event type

---- bus::tests::test_event_pattern_matching stdout ----

thread 'bus::tests::test_event_pattern_matching' (2428530) panicked at crates/events/src/bus.rs:545:9:
assertion failed: EventPattern::ByType("state_changed".to_string()).matches(&event)

---- bus::tests::should_deliver_events_only_to_matching_pattern_subscribers stdout ----

thread 'bus::tests::should_deliver_events_only_to_matching_pattern_subscribers' (2428521) panicked at crates/events/src/bus.rs:423:9:
Should not receive non-matching event

failures:
    bus::tests::should_deliver_events_only_to_matching_pattern_subscribers
    bus::tests::should_match_event_by_exact_type
    bus::tests::test_event_pattern_matching
    bus::tests::test_pattern_subscription

test result: FAILED. 74 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
