*** crates/events/src/bus.rs:91:9: replace EventBus::publish -> Result<EventId> with Ok(Default::default())

*** mutation diff:
--- crates/events/src/bus.rs
+++ replace EventBus::publish -> Result<EventId> with Ok(Default::default())
@@ -83,38 +83,17 @@
         }
     }
 
     /// Publish an event.
     ///
     /// The event is stored and broadcast to all subscribers.
     pub async fn publish(&self, event: BeadEvent) -> Result<EventId> {
         // Store the event
-        let event_id = self.store.append(event.clone()).await?;
-
-        debug!(
-            event_id = %event_id,
-            event_type = event.event_type(),
-            bead_id = %event.bead_id(),
-            "Publishing event"
-        );
-
-        // Broadcast to global subscribers
-        let _ = self.broadcast.send(event.clone());
-
-        // Send to pattern-based subscribers
-        let subscribers = self.subscribers.read().await;
-        subscribers
-            .iter()
-            .filter(|(_, sub)| sub.pattern.matches(&event))
-            .for_each(|(_, sub)| {
-                let _ = sub.sender.send(event.clone());
-            });
-
-        Ok(event_id)
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Subscribe to all events.
     pub fn subscribe(&self) -> EventSubscription {
         EventSubscription {
             receiver: self.broadcast.subscribe(),
         }
     }

---- bus::tests::test_replay stdout ----

thread 'bus::tests::test_replay' (2429965) panicked at crates/events/src/bus.rs:515:9:
assertion `left == right` failed
  left: 0
 right: 2

---- bus::tests::test_publish_and_subscribe stdout ----

thread 'bus::tests::test_publish_and_subscribe' (2429964) panicked at crates/events/src/bus.rs:442:9:
assertion failed: received.is_ok()

---- bus::tests::test_pattern_subscription stdout ----

thread 'bus::tests::test_pattern_subscription' (2429963) panicked at crates/events/src/bus.rs:475:9:
assertion failed: received.is_ok()

failures:
    bus::tests::should_deliver_events_only_to_matching_pattern_subscribers
    bus::tests::test_pattern_subscription
    bus::tests::test_publish_and_subscribe
    bus::tests::test_replay

test result: FAILED. 74 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
