*** crates/events/src/durable_store.rs:132:9: replace DurableEventStore::get_events_since -> Result<Vec<BeadEvent>> with Ok(vec![])

*** mutation diff:
--- crates/events/src/durable_store.rs
+++ replace DurableEventStore::get_events_since -> Result<Vec<BeadEvent>> with Ok(vec![])
@@ -124,24 +124,17 @@
             .filter(|e| e.bead_id() == stream_id)
             .cloned()
             .collect())
     }
 
     /// Get events since a specific event ID (sequence number filtering).
     pub fn get_events_since(&self, since: EventId) -> Result<Vec<BeadEvent>> {
         // Find position of the since event
-        let pos = self
-            .events
-            .iter()
-            .position(|e| e.event_id() == since)
-            .map(|p| p + 1) // Start from next event
-            .unwrap_or(0); // If not found, return all
-
-        Ok(self.events[pos..].to_vec())
+        Ok(vec![]) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Query events with filtering.
     pub fn query(&self, query: &EventQuery) -> Result<Vec<BeadEvent>> {
         Ok(query.filter_events(self.events.iter()).cloned().collect())
     }
 
     /// Get total count of events.

---- durable_store::tests::test_get_events_since stdout ----

thread 'durable_store::tests::test_get_events_since' (2441088) panicked at crates/events/src/durable_store.rs:242:13:
assertion `left == right` failed
  left: 0
 right: 2

failures:
    durable_store::tests::test_get_events_since

test result: FAILED. 77 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
