*** crates/events/src/durable_store.rs:149:9: replace DurableEventStore::count -> usize with 0

*** mutation diff:
--- crates/events/src/durable_store.rs
+++ replace DurableEventStore::count -> usize with 0
@@ -141,17 +141,17 @@
 
     /// Query events with filtering.
     pub fn query(&self, query: &EventQuery) -> Result<Vec<BeadEvent>> {
         Ok(query.filter_events(self.events.iter()).cloned().collect())
     }
 
     /// Get total count of events.
     pub fn count(&self) -> usize {
-        self.events.len()
+        0 /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl Default for DurableEventStore {
     fn default() -> Self {
         Self::new()
     }
 }

---- durable_store::tests::test_append_and_count stdout ----

thread 'durable_store::tests::test_append_and_count' (2443883) panicked at crates/events/src/durable_store.rs:175:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    durable_store::tests::test_append_and_count

test result: FAILED. 77 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
