*** crates/events/src/durable_store.rs:69:40: replace != with == in EventQuery::filter_events

*** mutation diff:
--- crates/events/src/durable_store.rs
+++ replace != with == in EventQuery::filter_events
@@ -61,17 +61,17 @@
     pub fn filter_events<'a>(
         &'a self,
         events: impl Iterator<Item = &'a BeadEvent> + 'a,
     ) -> impl Iterator<Item = &'a BeadEvent> + 'a {
         events
             .filter(move |event| {
                 // Filter by stream_id
                 if let Some(ref sid) = self.stream_id {
-                    if event.bead_id() != *sid {
+                    if event.bead_id() == /* ~ changed by cargo-mutants ~ */ *sid {
                         return false;
                     }
                 }
 
                 // Filter by event_type
                 if let Some(ref etype) = self.event_type {
                     if event.event_type() != etype.as_str() {
                         return false;

---- durable_store::tests::test_query_combined_filters stdout ----

thread 'durable_store::tests::test_query_combined_filters' (2437367) panicked at crates/events/src/durable_store.rs:382:13:
assertion `left == right` failed
  left: BeadId(Ulid(2139813079330301032258154399032294656))
 right: BeadId(Ulid(2139813079330715234150522730250803982))

failures:
    durable_store::tests::test_query_combined_filters

test result: FAILED. 77 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
