*** crates/events/src/projection.rs:151:9: replace <impl Projection for AllBeadsProjection>::apply with ()

*** mutation diff:
--- crates/events/src/projection.rs
+++ replace <impl Projection for AllBeadsProjection>::apply with ()
@@ -143,71 +143,17 @@
     }
 }
 
 #[async_trait]
 impl Projection for AllBeadsProjection {
     type State = AllBeadsState;
 
     fn apply(&self, state: &mut Self::State, event: &BeadEvent) {
-        match event {
-            BeadEvent::Created { bead_id, spec, .. } => {
-                let mut projection = BeadProjection::new(*bead_id);
-                projection.spec = Some(spec.clone());
-                projection.dependencies = spec.dependencies.clone();
-
-                // Update state counts
-                *state.state_counts.entry(BeadState::Pending).or_insert(0) += 1;
-
-                state.beads.insert(*bead_id, projection);
-            }
-            BeadEvent::StateChanged {
-                bead_id, from, to, ..
-            } => {
-                if let Some(bead) = state.beads.get_mut(bead_id) {
-                    bead.current_state = *to;
-                    bead.history.push(StateTransition::new(*from, *to));
-
-                    // Update state counts
-                    if let Some(count) = state.state_counts.get_mut(from) {
-                        *count = count.saturating_sub(1);
-                    }
-                    *state.state_counts.entry(*to).or_insert(0) += 1;
-                }
-            }
-            BeadEvent::PhaseCompleted {
-                bead_id, phase_id, ..
-            } => {
-                if let Some(bead) = state.beads.get_mut(bead_id) {
-                    bead.current_phase = Some(*phase_id);
-                }
-            }
-            BeadEvent::DependencyResolved {
-                bead_id,
-                dependency_id,
-                ..
-            } => {
-                if let Some(bead) = state.beads.get_mut(bead_id) {
-                    bead.blocked_by.retain(|id| id != dependency_id);
-                }
-            }
-            BeadEvent::Claimed {
-                bead_id, agent_id, ..
-            } => {
-                if let Some(bead) = state.beads.get_mut(bead_id) {
-                    bead.claimed_by = Some(agent_id.clone());
-                }
-            }
-            BeadEvent::Unclaimed { bead_id, .. } => {
-                if let Some(bead) = state.beads.get_mut(bead_id) {
-                    bead.claimed_by = None;
-                }
-            }
-            _ => {}
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     fn initial_state(&self) -> Self::State {
         AllBeadsState::new()
     }
 }
 
 /// A managed projection with automatic updates.

---- projection::tests::should_resolve_dependencies stdout ----

thread 'projection::tests::should_resolve_dependencies' (2456684) panicked at crates/events/src/projection.rs:475:9:
assertion failed: state.beads.get(&bead_id).map(|b| b.is_blocked()).unwrap_or(false)

---- projection::tests::should_track_claimed_agent stdout ----

thread 'projection::tests::should_track_claimed_agent' (2456690) panicked at crates/events/src/projection.rs:501:9:
assertion `left == right` failed: Claimed agent should be tracked
  left: None
 right: Some("agent-123")

---- projection::tests::should_track_phase_completion stdout ----

thread 'projection::tests::should_track_phase_completion' (2456691) panicked at crates/events/src/projection.rs:449:9:
assertion `left == right` failed: Phase should be tracked after completion
  left: None
 right: Some(PhaseId(Ulid(2139813114933400768213803437377127547)))

failures:
    projection::tests::should_resolve_dependencies
    projection::tests::should_track_claimed_agent
    projection::tests::should_track_phase_completion
    projection::tests::should_update_state_counts_on_bead_creation
    projection::tests::test_all_beads_projection_created
    projection::tests::test_all_beads_projection_state_changed
    projection::tests::test_managed_projection
    projection::tests::test_projection_rebuild

test result: FAILED. 70 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
