*** crates/events/src/projection.rs:162:13: delete match arm BeadEvent::StateChanged{bead_id, from, to, ..} in <impl Projection for AllBeadsProjection>::apply

*** mutation diff:
--- crates/events/src/projection.rs
+++ delete match arm BeadEvent::StateChanged{bead_id, from, to, ..} in <impl Projection for AllBeadsProjection>::apply
@@ -154,30 +154,17 @@
                 projection.spec = Some(spec.clone());
                 projection.dependencies = spec.dependencies.clone();
 
                 // Update state counts
                 *state.state_counts.entry(BeadState::Pending).or_insert(0) += 1;
 
                 state.beads.insert(*bead_id, projection);
             }
-            BeadEvent::StateChanged {
-                bead_id, from, to, ..
-            } => {
-                if let Some(bead) = state.beads.get_mut(bead_id) {
-                    bead.current_state = *to;
-                    bead.history.push(StateTransition::new(*from, *to));
-
-                    // Update state counts
-                    if let Some(count) = state.state_counts.get_mut(from) {
-                        *count = count.saturating_sub(1);
-                    }
-                    *state.state_counts.entry(*to).or_insert(0) += 1;
-                }
-            }
+             /* ~ changed by cargo-mutants ~ */
             BeadEvent::PhaseCompleted {
                 bead_id, phase_id, ..
             } => {
                 if let Some(bead) = state.beads.get_mut(bead_id) {
                     bead.current_phase = Some(*phase_id);
                 }
             }
             BeadEvent::DependencyResolved {

---- projection::tests::test_all_beads_projection_state_changed stdout ----

thread 'projection::tests::test_all_beads_projection_state_changed' (2457676) panicked at crates/events/src/projection.rs:615:9:
assertion `left == right` failed
  left: Some(Pending)
 right: Some(Scheduled)

---- projection::tests::test_projection_rebuild stdout ----

thread 'projection::tests::test_projection_rebuild' (2457680) panicked at crates/events/src/projection.rs:664:9:
assertion `left == right` failed
  left: Some(Pending)
 right: Some(Scheduled)

failures:
    projection::tests::test_all_beads_projection_state_changed
    projection::tests::test_projection_rebuild

test result: FAILED. 76 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
