*** crates/events/src/projection.rs:173:65: replace += with -= in <impl Projection for AllBeadsProjection>::apply

*** mutation diff:
--- crates/events/src/projection.rs
+++ replace += with -= in <impl Projection for AllBeadsProjection>::apply
@@ -165,17 +165,17 @@
                 if let Some(bead) = state.beads.get_mut(bead_id) {
                     bead.current_state = *to;
                     bead.history.push(StateTransition::new(*from, *to));
 
                     // Update state counts
                     if let Some(count) = state.state_counts.get_mut(from) {
                         *count = count.saturating_sub(1);
                     }
-                    *state.state_counts.entry(*to).or_insert(0) += 1;
+                    *state.state_counts.entry(*to).or_insert(0) -= /* ~ changed by cargo-mutants ~ */ 1;
                 }
             }
             BeadEvent::PhaseCompleted {
                 bead_id, phase_id, ..
             } => {
                 if let Some(bead) = state.beads.get_mut(bead_id) {
                     bead.current_phase = Some(*phase_id);
                 }

---- projection::tests::test_all_beads_projection_state_changed stdout ----

thread 'projection::tests::test_all_beads_projection_state_changed' (2461113) panicked at crates/events/src/projection.rs:173:21:
attempt to subtract with overflow

---- projection::tests::test_projection_rebuild stdout ----

thread 'projection::tests::test_projection_rebuild' (2461117) panicked at crates/events/src/projection.rs:173:21:
attempt to subtract with overflow

failures:
    projection::tests::test_all_beads_projection_state_changed
    projection::tests::test_projection_rebuild

test result: FAILED. 76 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
