*** crates/events/src/projection.rs:183:13: delete match arm BeadEvent::DependencyResolved{bead_id, dependency_id, ..} in <impl Projection for AllBeadsProjection>::apply

*** mutation diff:
--- crates/events/src/projection.rs
+++ delete match arm BeadEvent::DependencyResolved{bead_id, dependency_id, ..} in <impl Projection for AllBeadsProjection>::apply
@@ -175,25 +175,17 @@
             }
             BeadEvent::PhaseCompleted {
                 bead_id, phase_id, ..
             } => {
                 if let Some(bead) = state.beads.get_mut(bead_id) {
                     bead.current_phase = Some(*phase_id);
                 }
             }
-            BeadEvent::DependencyResolved {
-                bead_id,
-                dependency_id,
-                ..
-            } => {
-                if let Some(bead) = state.beads.get_mut(bead_id) {
-                    bead.blocked_by.retain(|id| id != dependency_id);
-                }
-            }
+             /* ~ changed by cargo-mutants ~ */
             BeadEvent::Claimed {
                 bead_id, agent_id, ..
             } => {
                 if let Some(bead) = state.beads.get_mut(bead_id) {
                     bead.claimed_by = Some(agent_id.clone());
                 }
             }
             BeadEvent::Unclaimed { bead_id, .. } => {

---- projection::tests::should_resolve_dependencies stdout ----

thread 'projection::tests::should_resolve_dependencies' (2458626) panicked at crates/events/src/projection.rs:527:9:
Bead should not be blocked after dependency resolved

failures:
    projection::tests::should_resolve_dependencies

test result: FAILED. 77 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
