*** crates/events/src/projection.rs:199:13: delete match arm BeadEvent::Unclaimed{bead_id, ..} in <impl Projection for AllBeadsProjection>::apply

*** mutation diff:
--- crates/events/src/projection.rs
+++ delete match arm BeadEvent::Unclaimed{bead_id, ..} in <impl Projection for AllBeadsProjection>::apply
@@ -191,21 +191,17 @@
             }
             BeadEvent::Claimed {
                 bead_id, agent_id, ..
             } => {
                 if let Some(bead) = state.beads.get_mut(bead_id) {
                     bead.claimed_by = Some(agent_id.clone());
                 }
             }
-            BeadEvent::Unclaimed { bead_id, .. } => {
-                if let Some(bead) = state.beads.get_mut(bead_id) {
-                    bead.claimed_by = None;
-                }
-            }
+             /* ~ changed by cargo-mutants ~ */
             _ => {}
         }
     }
 
     fn initial_state(&self) -> Self::State {
         AllBeadsState::new()
     }
 }

---- projection::tests::should_clear_claimed_agent_on_unclaim stdout ----

thread 'projection::tests::should_clear_claimed_agent_on_unclaim' (2459681) panicked at crates/events/src/projection.rs:572:9:
assertion `left == right` failed: Claimed agent should be cleared on unclaim
  left: Some("agent-123")
 right: None

failures:
    projection::tests::should_clear_claimed_agent_on_unclaim

test result: FAILED. 77 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
