*** crates/events/src/projection.rs:92:48: replace && with || in BeadProjection::is_ready

*** mutation diff:
--- crates/events/src/projection.rs
+++ replace && with || in BeadProjection::is_ready
@@ -84,17 +84,17 @@
 
     /// Check if the bead is blocked.
     pub fn is_blocked(&self) -> bool {
         !self.blocked_by.is_empty()
     }
 
     /// Check if the bead is ready to run.
     pub fn is_ready(&self) -> bool {
-        self.current_state == BeadState::Ready && !self.is_blocked()
+        self.current_state == BeadState::Ready || /* ~ changed by cargo-mutants ~ */ !self.is_blocked()
     }
 }
 
 /// State for all beads.
 #[derive(Debug, Clone, Default)]
 pub struct AllBeadsState {
     /// Projections by bead ID.
     pub beads: HashMap<BeadId, BeadProjection>,

---- projection::tests::should_not_be_ready_when_state_is_not_ready stdout ----

thread 'projection::tests::should_not_be_ready_when_state_is_not_ready' (2452436) panicked at crates/events/src/projection.rs:326:9:
Pending bead should not be ready

---- projection::tests::should_not_be_ready_when_blocked_even_if_state_is_ready stdout ----

thread 'projection::tests::should_not_be_ready_when_blocked_even_if_state_is_ready' (2452435) panicked at crates/events/src/projection.rs:337:9:
Blocked bead should not be ready even if state is Ready

---- projection::tests::should_return_only_ready_unblocked_beads stdout ----

thread 'projection::tests::should_return_only_ready_unblocked_beads' (2452444) panicked at crates/events/src/projection.rs:432:9:
assertion `left == right` failed: Should return exactly one ready bead
  left: 3
 right: 1

failures:
    projection::tests::should_not_be_ready_when_blocked_even_if_state_is_ready
    projection::tests::should_not_be_ready_when_state_is_not_ready
    projection::tests::should_return_only_ready_unblocked_beads

test result: FAILED. 75 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
