*** crates/events/src/replay.rs:42:9: replace ReplayProgress::calculate_percent -> f64 with 0.0

*** mutation diff:
--- crates/events/src/replay.rs
+++ replace ReplayProgress::calculate_percent -> f64 with 0.0
@@ -34,21 +34,17 @@
             percent_complete,
             eta: None,
         }
     }
 
     /// Calculate percentage complete.
     #[allow(dead_code)]
     fn calculate_percent(&self) -> f64 {
-        if self.events_total == 0 {
-            100.0
-        } else {
-            (self.events_processed as f64 / self.events_total as f64) * 100.0
-        }
+        0.0 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Update progress with new event count.
     #[allow(dead_code)]
     fn update(&mut self, events_processed: u64, eta: Option<Duration>) {
         self.events_processed = events_processed;
         self.percent_complete = self.calculate_percent();
         self.eta = eta;

---- replay::tests::test_replay_progress_calculate_percent stdout ----

thread 'replay::tests::test_replay_progress_calculate_percent' (2486108) panicked at crates/events/src/replay.rs:176:9:
assertion `left == right` failed
  left: 0.0
 right: 50.0

failures:
    replay::tests::test_replay_progress_calculate_percent

test result: FAILED. 77 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
