*** crates/events/src/replay.rs:45:71: replace * with / in ReplayProgress::calculate_percent

*** mutation diff:
--- crates/events/src/replay.rs
+++ replace * with / in ReplayProgress::calculate_percent
@@ -37,17 +37,17 @@
     }
 
     /// Calculate percentage complete.
     #[allow(dead_code)]
     fn calculate_percent(&self) -> f64 {
         if self.events_total == 0 {
             100.0
         } else {
-            (self.events_processed as f64 / self.events_total as f64) * 100.0
+            (self.events_processed as f64 / self.events_total as f64) / /* ~ changed by cargo-mutants ~ */ 100.0
         }
     }
 
     /// Update progress with new event count.
     #[allow(dead_code)]
     fn update(&mut self, events_processed: u64, eta: Option<Duration>) {
         self.events_processed = events_processed;
         self.percent_complete = self.calculate_percent();

---- replay::tests::test_replay_progress_calculate_percent stdout ----

thread 'replay::tests::test_replay_progress_calculate_percent' (2488499) panicked at crates/events/src/replay.rs:180:9:
assertion `left == right` failed
  left: 0.005
 right: 50.0

failures:
    replay::tests::test_replay_progress_calculate_percent

test result: FAILED. 77 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
