*** crates/events/src/replay.rs:90:9: replace ReplayTracker::increment -> Result<()> with Ok(())

*** mutation diff:
--- crates/events/src/replay.rs
+++ replace ReplayTracker::increment -> Result<()> with Ok(())
@@ -82,38 +82,17 @@
             update_interval,
         };
 
         (tracker, progress_rx)
     }
 
     /// Increment the event counter and optionally emit progress update.
     pub fn increment(&self) -> Result<()> {
-        let processed = self.events_processed.fetch_add(1, Ordering::Relaxed) + 1;
-
-        // Emit update every N events or on completion
-        if processed.is_multiple_of(self.update_interval) || processed == self.events_total {
-            let eta = self.calculate_eta(processed);
-            let progress = ReplayProgress {
-                events_total: self.events_total,
-                events_processed: processed,
-                percent_complete: if self.events_total == 0 {
-                    100.0
-                } else {
-                    (processed as f64 / self.events_total as f64) * 100.0
-                },
-                eta,
-            };
-
-            self.progress_tx
-                .send(progress)
-                .map_err(|_| crate::error::Error::Internal("Progress channel closed".into()))?;
-        }
-
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Calculate estimated time remaining.
     fn calculate_eta(&self, events_processed: u64) -> Option<Duration> {
         if events_processed == 0 || events_processed >= self.events_total {
             return None;
         }

*** result: Success
