*** crates/events/src/bus.rs:179:9: replace EventBusBuilder::with_channel_capacity -> Self with Default::default()

*** mutation diff:
--- crates/events/src/bus.rs
+++ replace EventBusBuilder::with_channel_capacity -> Self with Default::default()
@@ -171,18 +171,17 @@
     /// Set the event store.
     pub fn with_store(mut self, store: Arc<dyn EventStore>) -> Self {
         self.store = Some(store);
         self
     }
 
     /// Set the broadcast channel capacity.
     pub fn with_channel_capacity(mut self, capacity: usize) -> Self {
-        self.channel_capacity = capacity;
-        self
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Build the event bus.
     pub fn build(self) -> Result<EventBus> {
         let store = self
             .store
             .ok_or_else(|| Error::invalid_event("No event store configured"))?;

---- bus::tests::should_use_configured_channel_capacity stdout ----

thread 'bus::tests::should_use_configured_channel_capacity' (2433668) panicked at crates/events/src/bus.rs:342:14:
Should build: InvalidEvent { reason: "No event store configured" }

failures:
    bus::tests::should_use_configured_channel_capacity

test result: FAILED. 77 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
