*** crates/events/src/durable_store.rs:38:9: replace EventQuery::with_event_type -> Self with Default::default()

*** mutation diff:
--- crates/events/src/durable_store.rs
+++ replace EventQuery::with_event_type -> Self with Default::default()
@@ -30,18 +30,17 @@
     /// Filter by stream (bead) ID.
     pub fn with_stream_id(mut self, stream_id: BeadId) -> Self {
         self.stream_id = Some(stream_id);
         self
     }
 
     /// Filter by event type.
     pub fn with_event_type(mut self, event_type: impl Into<String>) -> Self {
-        self.event_type = Some(event_type.into());
-        self
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Filter events after this timestamp.
     pub fn after(mut self, timestamp: DateTime<Utc>) -> Self {
         self.after = Some(timestamp);
         self
     }

---- durable_store::tests::should_return_builder_self_from_before stdout ----

thread 'durable_store::tests::should_return_builder_self_from_before' (2434892) panicked at crates/events/src/durable_store.rs:496:9:
assertion `left == right` failed
  left: None
 right: Some("created")

---- durable_store::tests::test_event_query_filter_events stdout ----

thread 'durable_store::tests::test_event_query_filter_events' (2434895) panicked at crates/events/src/durable_store.rs:401:9:
assertion `left == right` failed
  left: 3
 right: 2

---- durable_store::tests::test_query_by_event_type stdout ----

thread 'durable_store::tests::test_query_by_event_type' (2434898) panicked at crates/events/src/durable_store.rs:278:13:
assertion `left == right` failed
  left: 3
 right: 2

failures:
    durable_store::tests::should_return_builder_self_from_before
    durable_store::tests::test_event_query_filter_events
    durable_store::tests::test_query_by_event_type
    durable_store::tests::test_query_combined_filters

test result: FAILED. 74 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
