*** crates/events/src/durable_store.rs:90:42: replace >= with < in EventQuery::filter_events

*** mutation diff:
--- crates/events/src/durable_store.rs
+++ replace >= with < in EventQuery::filter_events
@@ -82,17 +82,17 @@
                 if let Some(ref after) = self.after {
                     if event.timestamp() <= *after {
                         return false;
                     }
                 }
 
                 // Filter by before timestamp
                 if let Some(ref before) = self.before {
-                    if event.timestamp() >= *before {
+                    if event.timestamp() < /* ~ changed by cargo-mutants ~ */ *before {
                         return false;
                     }
                 }
 
                 true
             })
             .take(self.limit.unwrap_or(usize::MAX))
     }

---- durable_store::tests::should_exclude_events_at_exact_before_timestamp stdout ----

thread 'durable_store::tests::should_exclude_events_at_exact_before_timestamp' (2438926) panicked at crates/events/src/durable_store.rs:466:9:
assertion `left == right` failed: Event at exact before timestamp should be excluded
  left: 1
 right: 0

---- durable_store::tests::should_filter_events_before_timestamp stdout ----

thread 'durable_store::tests::should_filter_events_before_timestamp' (2438927) panicked at crates/events/src/durable_store.rs:444:9:
assertion `left == right` failed: Event before future timestamp should be included
  left: 0
 right: 1

failures:
    durable_store::tests::should_exclude_events_at_exact_before_timestamp
    durable_store::tests::should_filter_events_before_timestamp

test result: FAILED. 76 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
