*** crates/events/src/durable_store.rs:144:9: replace DurableEventStore::query -> Result<Vec<BeadEvent>> with Ok(vec![])

*** mutation diff:
--- crates/events/src/durable_store.rs
+++ replace DurableEventStore::query -> Result<Vec<BeadEvent>> with Ok(vec![])
@@ -136,17 +136,17 @@
             .map(|p| p + 1) // Start from next event
             .unwrap_or(0); // If not found, return all
 
         Ok(self.events[pos..].to_vec())
     }
 
     /// Query events with filtering.
     pub fn query(&self, query: &EventQuery) -> Result<Vec<BeadEvent>> {
-        Ok(query.filter_events(self.events.iter()).cloned().collect())
+        Ok(vec![]) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Get total count of events.
     pub fn count(&self) -> usize {
         self.events.len()
     }
 }

---- durable_store::tests::test_query_combined_filters stdout ----

thread 'durable_store::tests::test_query_combined_filters' (2443256) panicked at crates/events/src/durable_store.rs:381:13:
assertion `left == right` failed
  left: 0
 right: 1

---- durable_store::tests::test_query_by_event_type stdout ----

thread 'durable_store::tests::test_query_by_event_type' (2443254) panicked at crates/events/src/durable_store.rs:279:13:
assertion `left == right` failed
  left: 0
 right: 2

---- durable_store::tests::test_query_with_limit stdout ----

thread 'durable_store::tests::test_query_with_limit' (2443257) panicked at crates/events/src/durable_store.rs:342:13:
assertion `left == right` failed
  left: 0
 right: 2

failures:
    durable_store::tests::test_query_by_event_type
    durable_store::tests::test_query_by_timestamp
    durable_store::tests::test_query_combined_filters
    durable_store::tests::test_query_with_limit

test result: FAILED. 74 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
