*** crates/events/src/projection.rs:92:51: delete ! in BeadProjection::is_ready

*** mutation diff:
--- crates/events/src/projection.rs
+++ delete ! in BeadProjection::is_ready
@@ -84,17 +84,17 @@
 
     /// Check if the bead is blocked.
     pub fn is_blocked(&self) -> bool {
         !self.blocked_by.is_empty()
     }
 
     /// Check if the bead is ready to run.
     pub fn is_ready(&self) -> bool {
-        self.current_state == BeadState::Ready && !self.is_blocked()
+        self.current_state == BeadState::Ready &&  /* ~ changed by cargo-mutants ~ */self.is_blocked()
     }
 }
 
 /// State for all beads.
 #[derive(Debug, Clone, Default)]
 pub struct AllBeadsState {
     /// Projections by bead ID.
     pub beads: HashMap<BeadId, BeadProjection>,

---- projection::tests::should_be_ready_only_when_state_is_ready_and_not_blocked stdout ----

thread 'projection::tests::should_be_ready_only_when_state_is_ready_and_not_blocked' (2453386) panicked at crates/events/src/projection.rs:316:9:
Ready bead with no blockers should be ready

---- projection::tests::should_not_be_ready_when_blocked_even_if_state_is_ready stdout ----

thread 'projection::tests::should_not_be_ready_when_blocked_even_if_state_is_ready' (2453389) panicked at crates/events/src/projection.rs:337:9:
Blocked bead should not be ready even if state is Ready

---- projection::tests::should_return_only_ready_unblocked_beads stdout ----

thread 'projection::tests::should_return_only_ready_unblocked_beads' (2453398) panicked at crates/events/src/projection.rs:433:9:
assertion `left == right` failed: Should return the unblocked ready bead
  left: BeadId(Ulid(2139813109045347369804106031116308415))
 right: BeadId(Ulid(2139813109045398386395474223569376737))

failures:
    projection::tests::should_be_ready_only_when_state_is_ready_and_not_blocked
    projection::tests::should_not_be_ready_when_blocked_even_if_state_is_ready
    projection::tests::should_return_only_ready_unblocked_beads

test result: FAILED. 75 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
