*** crates/events/src/durable_store.rs:65:9: replace EventQuery::filter_events -> impl Iterator<Item =&'a BeadEvent>+'a with ::std::iter::empty()

*** mutation diff:
--- crates/events/src/durable_store.rs
+++ replace EventQuery::filter_events -> impl Iterator<Item =&'a BeadEvent>+'a with ::std::iter::empty()
@@ -57,49 +57,17 @@
         self
     }
 
     /// Apply filters to events using iterator combinators.
     pub fn filter_events<'a>(
         &'a self,
         events: impl Iterator<Item = &'a BeadEvent> + 'a,
     ) -> impl Iterator<Item = &'a BeadEvent> + 'a {
-        events
-            .filter(move |event| {
-                // Filter by stream_id
-                if let Some(ref sid) = self.stream_id {
-                    if event.bead_id() != *sid {
-                        return false;
-                    }
-                }
-
-                // Filter by event_type
-                if let Some(ref etype) = self.event_type {
-                    if event.event_type() != etype.as_str() {
-                        return false;
-                    }
-                }
-
-                // Filter by after timestamp
-                if let Some(ref after) = self.after {
-                    if event.timestamp() <= *after {
-                        return false;
-                    }
-                }
-
-                // Filter by before timestamp
-                if let Some(ref before) = self.before {
-                    if event.timestamp() >= *before {
-                        return false;
-                    }
-                }
-
-                true
-            })
-            .take(self.limit.unwrap_or(usize::MAX))
+        ::std::iter::empty() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Durable event store with query and filtering capabilities.
 pub struct DurableEventStore {
     events: Vec<BeadEvent>,
 }

---- durable_store::tests::should_filter_events_before_timestamp stdout ----

thread 'durable_store::tests::should_filter_events_before_timestamp' (2436788) panicked at crates/events/src/durable_store.rs:412:9:
assertion `left == right` failed: Event before future timestamp should be included
  left: 0
 right: 1

---- durable_store::tests::test_event_query_filter_events stdout ----

thread 'durable_store::tests::test_event_query_filter_events' (2436792) panicked at crates/events/src/durable_store.rs:370:9:
assertion `left == right` failed
  left: 0
 right: 2

---- durable_store::tests::test_query_by_event_type stdout ----

thread 'durable_store::tests::test_query_by_event_type' (2436795) panicked at crates/events/src/durable_store.rs:247:13:
assertion `left == right` failed
  left: 0
 right: 2

failures:
    durable_store::tests::should_filter_events_before_timestamp
    durable_store::tests::test_event_query_filter_events
    durable_store::tests::test_query_by_event_type
    durable_store::tests::test_query_by_timestamp
    durable_store::tests::test_query_combined_filters
    durable_store::tests::test_query_with_limit

test result: FAILED. 72 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
