*** crates/events/src/projection.rs:239:9: replace ManagedProjection<P>::apply with ()

*** mutation diff:
--- crates/events/src/projection.rs
+++ replace ManagedProjection<P>::apply with ()
@@ -231,18 +231,17 @@
         Self {
             projection,
             state: RwLock::new(state),
         }
     }
 
     /// Apply an event.
     pub async fn apply(&self, event: &BeadEvent) {
-        let mut state = self.state.write().await;
-        self.projection.apply(&mut state, event);
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// Get the current state.
     pub async fn state(&self) -> P::State {
         self.state.read().await.clone()
     }
 
     /// Rebuild from a store.

---- projection::tests::test_managed_projection stdout ----

thread 'projection::tests::test_managed_projection' (2463106) panicked at crates/events/src/projection.rs:647:9:
assertion failed: state.beads.contains_key(&bead_id)

failures:
    projection::tests::test_managed_projection

test result: FAILED. 77 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
