*** crates/events/src/event.rs:266:9: replace BeadEvent::event_type -> &'static str with ""

*** mutation diff:
--- crates/events/src/event.rs
+++ replace BeadEvent::event_type -> &'static str with ""
@@ -258,28 +258,17 @@
             | Self::Unclaimed { timestamp, .. }
             | Self::PriorityChanged { timestamp, .. }
             | Self::MetadataUpdated { timestamp, .. } => *timestamp,
         }
     }
 
     /// Get the event type name.
     pub fn event_type(&self) -> &'static str {
-        match self {
-            Self::Created { .. } => "created",
-            Self::StateChanged { .. } => "state_changed",
-            Self::PhaseCompleted { .. } => "phase_completed",
-            Self::DependencyResolved { .. } => "dependency_resolved",
-            Self::Failed { .. } => "failed",
-            Self::Completed { .. } => "completed",
-            Self::Claimed { .. } => "claimed",
-            Self::Unclaimed { .. } => "unclaimed",
-            Self::PriorityChanged { .. } => "priority_changed",
-            Self::MetadataUpdated { .. } => "metadata_updated",
-        }
+        "" /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use crate::types::Complexity;

---- bus::tests::should_match_event_by_exact_type stdout ----

thread 'bus::tests::should_match_event_by_exact_type' (2448519) panicked at crates/events/src/bus.rs:237:9:
ByType should match correct event type

---- bus::tests::should_match_event_by_multiple_types stdout ----

thread 'bus::tests::should_match_event_by_multiple_types' (2448520) panicked at crates/events/src/bus.rs:283:9:
ByTypes should match when event type is in list

---- bus::tests::test_event_pattern_matching stdout ----

thread 'bus::tests::test_event_pattern_matching' (2448524) panicked at crates/events/src/bus.rs:545:9:
assertion failed: EventPattern::ByType("state_changed".to_string()).matches(&event)

failures:
    bus::tests::should_deliver_events_only_to_matching_pattern_subscribers
    bus::tests::should_match_event_by_exact_type
    bus::tests::should_match_event_by_multiple_types
    bus::tests::test_event_pattern_matching
    bus::tests::test_pattern_subscription
    durable_store::tests::test_event_query_filter_events
    durable_store::tests::test_get_events_since
    durable_store::tests::test_query_by_event_type
    durable_store::tests::test_query_by_timestamp
    durable_store::tests::test_query_combined_filters
    event::tests::test_completed_event
    event::tests::test_created_event

test result: FAILED. 65 passed; 13 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
