*** crates/events/src/projection.rs:113:9: replace AllBeadsState::get -> Option<&BeadProjection> with None

*** mutation diff:
--- crates/events/src/projection.rs
+++ replace AllBeadsState::get -> Option<&BeadProjection> with None
@@ -105,17 +105,17 @@
 impl AllBeadsState {
     /// Create a new empty state.
     pub fn new() -> Self {
         Self::default()
     }
 
     /// Get a bead projection.
     pub fn get(&self, bead_id: &BeadId) -> Option<&BeadProjection> {
-        self.beads.get(bead_id)
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     /// Get beads in a given state.
     pub fn in_state(&self, state: BeadState) -> Vec<&BeadProjection> {
         self.beads
             .values()
             .filter(|b| b.current_state == state)
             .collect()

---- projection::tests::should_return_bead_when_it_exists stdout ----

thread 'projection::tests::should_return_bead_when_it_exists' (2453890) panicked at crates/events/src/projection.rs:355:9:
Should return Some for existing bead

failures:
    projection::tests::should_return_bead_when_it_exists

test result: FAILED. 77 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
