*** crates/events/src/projection.rs:192:13: delete match arm BeadEvent::Claimed{bead_id, agent_id, ..} in <impl Projection for AllBeadsProjection>::apply

*** mutation diff:
--- crates/events/src/projection.rs
+++ delete match arm BeadEvent::Claimed{bead_id, agent_id, ..} in <impl Projection for AllBeadsProjection>::apply
@@ -184,23 +184,17 @@
                 bead_id,
                 dependency_id,
                 ..
             } => {
                 if let Some(bead) = state.beads.get_mut(bead_id) {
                     bead.blocked_by.retain(|id| id != dependency_id);
                 }
             }
-            BeadEvent::Claimed {
-                bead_id, agent_id, ..
-            } => {
-                if let Some(bead) = state.beads.get_mut(bead_id) {
-                    bead.claimed_by = Some(agent_id.clone());
-                }
-            }
+             /* ~ changed by cargo-mutants ~ */
             BeadEvent::Unclaimed { bead_id, .. } => {
                 if let Some(bead) = state.beads.get_mut(bead_id) {
                     bead.claimed_by = None;
                 }
             }
             _ => {}
         }
     }

---- projection::tests::should_track_claimed_agent stdout ----

thread 'projection::tests::should_track_claimed_agent' (2459102) panicked at crates/events/src/projection.rs:549:9:
assertion `left == right` failed: Claimed agent should be tracked
  left: None
 right: Some("agent-123")

failures:
    projection::tests::should_track_claimed_agent

test result: FAILED. 77 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
