*** crates/events/src/projection.rs:87:9: delete ! in BeadProjection::is_blocked

*** mutation diff:
--- crates/events/src/projection.rs
+++ delete ! in BeadProjection::is_blocked
@@ -79,17 +79,17 @@
             blocked_by: Vec::new(),
             history: Vec::new(),
             claimed_by: None,
         }
     }
 
     /// Check if the bead is blocked.
     pub fn is_blocked(&self) -> bool {
-        !self.blocked_by.is_empty()
+         /* ~ changed by cargo-mutants ~ */self.blocked_by.is_empty()
     }
 
     /// Check if the bead is ready to run.
     pub fn is_ready(&self) -> bool {
         self.current_state == BeadState::Ready && !self.is_blocked()
     }
 }

---- projection::tests::should_be_ready_only_when_state_is_ready_and_not_blocked stdout ----

thread 'projection::tests::should_be_ready_only_when_state_is_ready_and_not_blocked' (2450907) panicked at crates/events/src/projection.rs:316:9:
Ready bead with no blockers should be ready

---- projection::tests::should_not_be_ready_when_blocked_even_if_state_is_ready stdout ----

thread 'projection::tests::should_not_be_ready_when_blocked_even_if_state_is_ready' (2450910) panicked at crates/events/src/projection.rs:337:9:
Blocked bead should not be ready even if state is Ready

---- projection::tests::should_report_blocked_when_blocked_by_is_not_empty stdout ----

thread 'projection::tests::should_report_blocked_when_blocked_by_is_not_empty' (2450912) panicked at crates/events/src/projection.rs:297:9:
Bead with blockers should report as blocked

failures:
    projection::tests::should_be_ready_only_when_state_is_ready_and_not_blocked
    projection::tests::should_not_be_ready_when_blocked_even_if_state_is_ready
    projection::tests::should_report_blocked_when_blocked_by_is_not_empty
    projection::tests::should_report_not_blocked_when_blocked_by_is_empty
    projection::tests::should_resolve_dependencies
    projection::tests::should_return_only_blocked_beads
    projection::tests::should_return_only_ready_unblocked_beads
    projection::tests::test_bead_projection_new

test result: FAILED. 70 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
