*** crates/events/src/durable_store.rs:76:43: replace != with == in EventQuery::filter_events

*** mutation diff:
--- crates/events/src/durable_store.rs
+++ replace != with == in EventQuery::filter_events
@@ -68,17 +68,17 @@
                 if let Some(ref sid) = self.stream_id {
                     if event.bead_id() != *sid {
                         return false;
                     }
                 }
 
                 // Filter by event_type
                 if let Some(ref etype) = self.event_type {
-                    if event.event_type() != etype.as_str() {
+                    if event.event_type() == /* ~ changed by cargo-mutants ~ */ etype.as_str() {
                         return false;
                     }
                 }
 
                 // Filter by after timestamp
                 if let Some(ref after) = self.after {
                     if event.timestamp() <= *after {
                         return false;

---- durable_store::tests::test_event_query_filter_events stdout ----

thread 'durable_store::tests::test_event_query_filter_events' (2437854) panicked at crates/events/src/durable_store.rs:402:9:
assertion `left == right` failed
  left: 1
 right: 2

---- durable_store::tests::test_query_by_event_type stdout ----

thread 'durable_store::tests::test_query_by_event_type' (2437857) panicked at crates/events/src/durable_store.rs:279:13:
assertion `left == right` failed
  left: 1
 right: 2

---- durable_store::tests::test_query_combined_filters stdout ----

thread 'durable_store::tests::test_query_combined_filters' (2437859) panicked at crates/events/src/durable_store.rs:383:13:
assertion `left == right` failed
  left: "created"
 right: "state_changed"

failures:
    durable_store::tests::test_event_query_filter_events
    durable_store::tests::test_query_by_event_type
    durable_store::tests::test_query_combined_filters

test result: FAILED. 75 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
