*** crates/events/src/projection.rs:131:9: replace AllBeadsState::blocked -> Vec<&BeadProjection> with vec![]

*** mutation diff:
--- crates/events/src/projection.rs
+++ replace AllBeadsState::blocked -> Vec<&BeadProjection> with vec![]
@@ -123,17 +123,17 @@
 
     /// Get ready beads (not blocked).
     pub fn ready(&self) -> Vec<&BeadProjection> {
         self.beads.values().filter(|b| b.is_ready()).collect()
     }
 
     /// Get blocked beads.
     pub fn blocked(&self) -> Vec<&BeadProjection> {
-        self.beads.values().filter(|b| b.is_blocked()).collect()
+        vec![] /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Projection for all beads.
 #[derive(Default)]
 pub struct AllBeadsProjection;
 
 impl AllBeadsProjection {

---- projection::tests::should_return_only_blocked_beads stdout ----

thread 'projection::tests::should_return_only_blocked_beads' (2456122) panicked at crates/events/src/projection.rs:455:9:
assertion `left == right` failed: Should return exactly one blocked bead
  left: 0
 right: 1

failures:
    projection::tests::should_return_only_blocked_beads

test result: FAILED. 77 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
