*** crates/events/src/projection.rs:176:13: delete match arm BeadEvent::PhaseCompleted{bead_id, phase_id, ..} in <impl Projection for AllBeadsProjection>::apply

*** mutation diff:
--- crates/events/src/projection.rs
+++ delete match arm BeadEvent::PhaseCompleted{bead_id, phase_id, ..} in <impl Projection for AllBeadsProjection>::apply
@@ -168,23 +168,17 @@
 
                     // Update state counts
                     if let Some(count) = state.state_counts.get_mut(from) {
                         *count = count.saturating_sub(1);
                     }
                     *state.state_counts.entry(*to).or_insert(0) += 1;
                 }
             }
-            BeadEvent::PhaseCompleted {
-                bead_id, phase_id, ..
-            } => {
-                if let Some(bead) = state.beads.get_mut(bead_id) {
-                    bead.current_phase = Some(*phase_id);
-                }
-            }
+             /* ~ changed by cargo-mutants ~ */
             BeadEvent::DependencyResolved {
                 bead_id,
                 dependency_id,
                 ..
             } => {
                 if let Some(bead) = state.beads.get_mut(bead_id) {
                     bead.blocked_by.retain(|id| id != dependency_id);
                 }

---- projection::tests::should_track_phase_completion stdout ----

thread 'projection::tests::should_track_phase_completion' (2458164) panicked at crates/events/src/projection.rs:497:9:
assertion `left == right` failed: Phase should be tracked after completion
  left: None
 right: Some(PhaseId(Ulid(2139813117421529624914600034835135172)))

failures:
    projection::tests::should_track_phase_completion

test result: FAILED. 77 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
