*** crates/events/src/projection.rs:250:9: replace ManagedProjection<P>::rebuild -> Result<()> with Ok(())

*** mutation diff:
--- crates/events/src/projection.rs
+++ replace ManagedProjection<P>::rebuild -> Result<()> with Ok(())
@@ -242,17 +242,17 @@
 
     /// Get the current state.
     pub async fn state(&self) -> P::State {
         self.state.read().await.clone()
     }
 
     /// Rebuild from a store.
     pub async fn rebuild(&self, store: &dyn EventStore) -> Result<()> {
-        self.rebuild_with_progress(store, None).await
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Rebuild from a store with optional progress tracking.
     pub async fn rebuild_with_progress(
         &self,
         store: &dyn EventStore,
         tracker: Option<&ReplayTracker>,
     ) -> Result<()> {

*** result: Success
