*** crates/events/src/projection.rs:92:9: replace BeadProjection::is_ready -> bool with false

*** mutation diff:
--- crates/events/src/projection.rs
+++ replace BeadProjection::is_ready -> bool with false
@@ -84,17 +84,17 @@
 
     /// Check if the bead is blocked.
     pub fn is_blocked(&self) -> bool {
         !self.blocked_by.is_empty()
     }
 
     /// Check if the bead is ready to run.
     pub fn is_ready(&self) -> bool {
-        self.current_state == BeadState::Ready && !self.is_blocked()
+        false /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// State for all beads.
 #[derive(Debug, Clone, Default)]
 pub struct AllBeadsState {
     /// Projections by bead ID.
     pub beads: HashMap<BeadId, BeadProjection>,

---- projection::tests::should_be_ready_only_when_state_is_ready_and_not_blocked stdout ----

thread 'projection::tests::should_be_ready_only_when_state_is_ready_and_not_blocked' (2451959) panicked at crates/events/src/projection.rs:316:9:
Ready bead with no blockers should be ready

---- projection::tests::should_return_only_ready_unblocked_beads stdout ----

thread 'projection::tests::should_return_only_ready_unblocked_beads' (2451971) panicked at crates/events/src/projection.rs:432:9:
assertion `left == right` failed: Should return exactly one ready bead
  left: 0
 right: 1

failures:
    projection::tests::should_be_ready_only_when_state_is_ready_and_not_blocked
    projection::tests::should_return_only_ready_unblocked_beads

test result: FAILED. 76 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
